content/notas/IS/Notas.org
#+title: Ingeniería de Software
#+author: Erik Rangel Limón
#+startup: content
#+startup: latexpreview

- Código de classroom: 3xjcc6g
- Link de meet: https://meet.google.com/xgj-xgwi-urj

* Bibliografía

  Guadalupe Ibargüengoitia G. Hanna Oktaba. Introducción a la
  Ingeniería de Software

* Evaluación
  
** Clases teóricas:

   - Participación activa en las discusiones sobre temas teóricos

   - Presentación de los productos de trabajo desarrollados
     individualmente y por el equipo.


   Examen teórico individual al final de la primera iteración

** Ayudantía:

   - Participación equitativa de los alumnos en el trabajo del equipo
     al generar los documentos


   Entrega puntual de documentos y del código por equipo.

** Laboratorio:

   - Evaluaciones individuales a cada alumno de su aprovechamiento en
     el aprendizaje de las herramientas.

   - Examen.

** Calificación final

   - 40% calificación del equipo documentación y funcionamiento del
     sistema, desempeño del equipo. *Calificación individual*.
     
   - 20% calificación individual por examen teórico, participación y
     asistencia a las clases teóricas.
     
   - 20% calificación individual de la ayudantía, desempeño individual
     en el rol asignado, uso del tablero de tarjetas de trabajo y
     asistencia.
     
   - 20% calificación individual del laboratorio, evaluaciones de la
     implementación de los casos de uso asignados, examen del
     laboratorio y asistencia.


   Al empezar a recibir calificaciones ya no se tendrá derecho a NP.

* Notas de Clase

** Clase 1

*** Objetivo

    Aprender las mejores prácticas de la ingeniería de software para
    el trabajo en equipo.
    
*** Temario

    1. Introducción a la Ingeniería de Software.

    2. Cómo y con qué vamos a trabajar. Método del curso.

    3. Pacticas sociales: Trabajo en equipo.

    4. Prácticas administrativas: Administración de proyectos.

    5. Requerimientos de software.

    6. Diseño de software.

    7. Construcción de software.

    8. Integración y prueba de software.

    9. Cierre del proyecto.

    10. Temas avanzados de ingeniería de software:

	* Métodos ágiles.

	* Estándares de desarrollo de software

	* Código de ética.
  
** Clase 2

*** Diferencia entre programación e ingeniería de software

    * La ingeniería de Software es una disciplina reciente, comparada
      con otras ingenierías.

    * Sus inicios datan de finales de los años sesenta del siglo
      pasado, mientras que, por ejemplo, ingeniería civil tiene
      antigüedad milenaria.

    * Mientras que la programación es la capacidad de poder dar
      órdenes a una computadora para crear un algoritmo y resolver un
      problema determinado.

*** Definiciones de la Ingeniería de Software

    * La Ingeniería de software es la aplicación de un enfoque
      sistemáticos, discriplinado y cuantificable al desarrollo, la
      operación y el mantenimiento de software (SEVOCAB, 2017).

    * La Ingeniería de Software es una disciplina de la ingeniería que
      se ocupa de todos los aspectos de la producción del software,
      desde sus pasos iniciales de la especificación del sistema,
      hasta el mantenimiento cuando está en uso (Sommerville I., 2011).

    * La aplicación de un enfoque sistemático, disciplinado,
      cuantificable para el desarrollo, operación y el mantenimiento
      del software (IEEE, 1990).

    * La ingeniería de Software es la construcción de _productos de
      software_ por grupos de personas, para que san usadas por otras.

    * El _cliente_ es quien solicita el desarrollo del producto y
      plantea el problema a resolver.

    * El _equipo de desarrollo construye y entrega_ el producto
      solicitado.

