notas/IS/Notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ingeniería de Software</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ingeniería de Software</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ecbf73">Bibliografía</a></li>
<li><a href="#orgb286e88">Evaluación</a>
<ul>
<li><a href="#org1088322">Clases teóricas:</a></li>
<li><a href="#org736ff8e">Ayudantía:</a></li>
<li><a href="#org49019db">Laboratorio:</a></li>
<li><a href="#orgf32eef6">Calificación final</a></li>
</ul>
</li>
<li><a href="#org1314d0a">Notas de Clase</a>
<ul>
<li><a href="#org815598e">Clase 1</a>
<ul>
<li><a href="#org7475c02">Objetivo</a></li>
<li><a href="#org6e3931f">Temario</a></li>
</ul>
</li>
<li><a href="#org27f7417">Clase 2</a>
<ul>
<li><a href="#orgf44397c">Diferencia entre programación e ingeniería de software</a></li>
<li><a href="#org0c0ef2a">Definiciones de la Ingeniería de Software</a></li>
<li><a href="#org8f5c73a">Objetivo de la Ingeniería de Software</a></li>
<li><a href="#orgbe72efe">Campo de acción de la Ingeniería de Software</a></li>
<li><a href="#orgd9a3bca">Relación entre las Matemáticas, Ciencias de la Computación e Ingeniería de Software</a></li>
<li><a href="#orgf70c5d4">Software</a></li>
</ul>
</li>
<li><a href="#org44a4471">Clase 3</a>
<ul>
<li><a href="#org5c58607">Características del software</a></li>
<li><a href="#orgf37be8b">Tipos de software</a></li>
<li><a href="#org03a95b4">Calidad de software</a></li>
<li><a href="#org3d5d746">Prácticas de calidad</a></li>
</ul>
</li>
<li><a href="#orgc2f435b">Laboratorio 1</a>
<ul>
<li><a href="#orgf4d6b59">Glosario de Bases de Datos (MySQL)</a></li>
</ul>
</li>
<li><a href="#orgeaba026">Clase 4</a>
<ul>
<li><a href="#org09d2ab4">Cualidades del software</a></li>
<li><a href="#orgdd5d4e3">Definición de cliente y equipo de desarrollo</a></li>
<li><a href="#org8cb1583">Ciclo de vida de software</a></li>
</ul>
</li>
<li><a href="#orgefef69e">Clase 5</a>
<ul>
<li><a href="#orgf903d8f">Roles</a></li>
</ul>
</li>
<li><a href="#orgbd9bfef">Clase 6</a>
<ul>
<li><a href="#orgd77e663">Etapa de desarrollo</a></li>
<li><a href="#org8543548">Principios de la Ingeniería de Software</a></li>
<li><a href="#org19f02c0">Historia de la Ingeniería de Software</a></li>
</ul>
</li>
<li><a href="#org0fbac35">Clase 7</a>
<ul>
<li><a href="#orgeba05b7">Historia de la Ingeniería de Software</a></li>
</ul>
</li>
<li><a href="#org2d014c6">Clase 8</a>
<ul>
<li><a href="#orgc232f62">Cuerpo de Conociemientos de la Ingeniería de Software</a></li>
<li><a href="#orgd327097">Ingeniería de Software como profesión</a></li>
<li><a href="#org023fe88">Estándares</a></li>
<li><a href="#orge0fb16a">Administración de Proyecto</a></li>
<li><a href="#org370f34b">Implementación de Software</a></li>
<li><a href="#org7b37b9f">SCRUM prácticas ágiles</a></li>
</ul>
</li>
<li><a href="#orgf7095df">Clase 9</a>
<ul>
<li><a href="#org3d62d32">Kuali-Beh</a></li>
<li><a href="#org3b6872f">UML</a></li>
</ul>
</li>
<li><a href="#org6d03bdb">Clase 10</a>
<ul>
<li><a href="#orgf6ca190">Métodos y prácticas a utilizar</a></li>
</ul>
</li>
<li><a href="#org5e6c3c1">Clase 11</a>
<ul>
<li><a href="#org8fbf516">Concepto de equipo</a></li>
<li><a href="#org2a6c00e">Tamaño de un equipo</a></li>
</ul>
</li>
<li><a href="#orga635aff">Clase 12</a>
<ul>
<li><a href="#org3fec249">Práctoca Social 1. Conformación del equipo</a></li>
<li><a href="#org126913b">Práctica Social 2. Definición de la comunicación en el equipo</a></li>
<li><a href="#orgf7fffff">Práctica Social 3. Creación del repositorio común de documentos</a></li>
</ul>
</li>
<li><a href="#orgb67cabb">Unidad 4</a>
<ul>
<li><a href="#orgf72a853">Concepto de Proyecto</a></li>
<li><a href="#org1598646">Administración de Proyecto</a></li>
<li><a href="#org957b71c">Planificar el proyecto</a></li>
<li><a href="#orgb0b2f78">Diagrama general de casos de uso</a></li>
<li><a href="#orgcd6768f">Práctica Administrativa 1. Planificar el proyecto</a></li>
<li><a href="#orge187c4c">Pŕactica Administrativa 2. Planificar la iteración</a></li>
<li><a href="#orgcfc8328">Práctica Administrativa 3. Ejecutar el plan de la iteración</a></li>
<li><a href="#org5c30075">Práctica Administratica 4. Evaluar y controlar la iteración</a></li>
</ul>
</li>
<li><a href="#org947fd19">Unidad 5. Requerimientos de software</a>
<ul>
<li><a href="#org4b9f23f">¿Qué es un requerimiento?</a></li>
<li><a href="#orgedfbd2c">¿Cómo se expresan los requerimientos?</a></li>
<li><a href="#org530e90d">Objetivos de la especificación de requerimientos</a></li>
<li><a href="#org078b960">Calidad de un producto de software</a></li>
<li><a href="#orgfc486ed">¿Cómo asegurar la calidad de la especificación de los requerimientos?</a></li>
<li><a href="#org7a2d9fc">Tipos de requerimientos</a></li>
<li><a href="#org18f58de">Actividades para definir los requerimientos</a></li>
<li><a href="#orgbd71aa4">Caso de prueba</a></li>
<li><a href="#orgc65fa5b">Práctica de desarrollo de software</a></li>
</ul>
</li>
<li><a href="#orgd343557">Unidad 6. Diseño de Software</a>
<ul>
<li><a href="#org0edd5c7">Diseño de Software</a></li>
<li><a href="#orgebb6a0e">Objetivos del diseño</a></li>
<li><a href="#org3366e49">Niveles de abstracción.</a></li>
<li><a href="#orgc1828ac">Principios para el Diseño</a></li>
<li><a href="#org9ee9bd2">Otros principios</a></li>
<li><a href="#orge4d7872">Cualidades del software</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org016a04c">Tareas</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>Código de classroom: 3xjcc6g</li>
<li>Link de meet: <a href="https://meet.google.com/xgj-xgwi-urj">https://meet.google.com/xgj-xgwi-urj</a></li>
</ul>

<div id="outline-container-org1ecbf73" class="outline-2">
<h2 id="org1ecbf73">Bibliografía</h2>
<div class="outline-text-2" id="text-org1ecbf73">
<p>
Guadalupe Ibargüengoitia G. Hanna Oktaba. Introducción a la
Ingeniería de Software
</p>
</div>
</div>

<div id="outline-container-orgb286e88" class="outline-2">
<h2 id="orgb286e88">Evaluación</h2>
<div class="outline-text-2" id="text-orgb286e88">
</div>
<div id="outline-container-org1088322" class="outline-3">
<h3 id="org1088322">Clases teóricas:</h3>
<div class="outline-text-3" id="text-org1088322">
<ul class="org-ul">
<li>Participación activa en las discusiones sobre temas teóricos</li>

<li>Presentación de los productos de trabajo desarrollados
individualmente y por el equipo.</li>
</ul>


<p>
Examen teórico individual al final de la primera iteración
</p>
</div>
</div>

<div id="outline-container-org736ff8e" class="outline-3">
<h3 id="org736ff8e">Ayudantía:</h3>
<div class="outline-text-3" id="text-org736ff8e">
<ul class="org-ul">
<li>Participación equitativa de los alumnos en el trabajo del equipo
al generar los documentos</li>
</ul>


<p>
Entrega puntual de documentos y del código por equipo.
</p>
</div>
</div>

<div id="outline-container-org49019db" class="outline-3">
<h3 id="org49019db">Laboratorio:</h3>
<div class="outline-text-3" id="text-org49019db">
<ul class="org-ul">
<li>Evaluaciones individuales a cada alumno de su aprovechamiento en
el aprendizaje de las herramientas.</li>

<li>Examen.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf32eef6" class="outline-3">
<h3 id="orgf32eef6">Calificación final</h3>
<div class="outline-text-3" id="text-orgf32eef6">
<ul class="org-ul">
<li>40% calificación del equipo documentación y funcionamiento del
sistema, desempeño del equipo. <b>Calificación individual</b>.</li>

<li>20% calificación individual por examen teórico, participación y
asistencia a las clases teóricas.</li>

<li>20% calificación individual de la ayudantía, desempeño individual
en el rol asignado, uso del tablero de tarjetas de trabajo y
asistencia.</li>

<li>20% calificación individual del laboratorio, evaluaciones de la
implementación de los casos de uso asignados, examen del
laboratorio y asistencia.</li>
</ul>


<p>
Al empezar a recibir calificaciones ya no se tendrá derecho a NP.
</p>
</div>
</div>
</div>

<div id="outline-container-org1314d0a" class="outline-2">
<h2 id="org1314d0a">Notas de Clase</h2>
<div class="outline-text-2" id="text-org1314d0a">
</div>
<div id="outline-container-org815598e" class="outline-3">
<h3 id="org815598e">Clase 1</h3>
<div class="outline-text-3" id="text-org815598e">
</div>
<div id="outline-container-org7475c02" class="outline-4">
<h4 id="org7475c02">Objetivo</h4>
<div class="outline-text-4" id="text-org7475c02">
<p>
Aprender las mejores prácticas de la ingeniería de software para
el trabajo en equipo.
</p>
</div>
</div>

<div id="outline-container-org6e3931f" class="outline-4">
<h4 id="org6e3931f">Temario</h4>
<div class="outline-text-4" id="text-org6e3931f">
<ol class="org-ol">
<li>Introducción a la Ingeniería de Software.</li>

<li>Cómo y con qué vamos a trabajar. Método del curso.</li>

<li>Pacticas sociales: Trabajo en equipo.</li>

<li>Prácticas administrativas: Administración de proyectos.</li>

<li>Requerimientos de software.</li>

<li>Diseño de software.</li>

<li>Construcción de software.</li>

<li>Integración y prueba de software.</li>

<li>Cierre del proyecto.</li>

<li>Temas avanzados de ingeniería de software:

<ul class="org-ul">
<li>Métodos ágiles.</li>

<li>Estándares de desarrollo de software</li>

<li>Código de ética.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org27f7417" class="outline-3">
<h3 id="org27f7417">Clase 2</h3>
<div class="outline-text-3" id="text-org27f7417">
</div>
<div id="outline-container-orgf44397c" class="outline-4">
<h4 id="orgf44397c">Diferencia entre programación e ingeniería de software</h4>
<div class="outline-text-4" id="text-orgf44397c">
<ul class="org-ul">
<li>La ingeniería de Software es una disciplina reciente, comparada
con otras ingenierías.</li>

<li>Sus inicios datan de finales de los años sesenta del siglo
pasado, mientras que, por ejemplo, ingeniería civil tiene
antigüedad milenaria.</li>

<li>Mientras que la programación es la capacidad de poder dar
órdenes a una computadora para crear un algoritmo y resolver un
problema determinado.</li>
</ul>
</div>
</div>

<div id="outline-container-org0c0ef2a" class="outline-4">
<h4 id="org0c0ef2a">Definiciones de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-org0c0ef2a">
<ul class="org-ul">
<li>La Ingeniería de software es la aplicación de un enfoque
sistemáticos, discriplinado y cuantificable al desarrollo, la
operación y el mantenimiento de software (SEVOCAB, 2017).</li>

<li>La Ingeniería de Software es una disciplina de la ingeniería que
se ocupa de todos los aspectos de la producción del software,
desde sus pasos iniciales de la especificación del sistema,
hasta el mantenimiento cuando está en uso (Sommerville I., 2011).</li>

<li>La aplicación de un enfoque sistemático, disciplinado,
cuantificable para el desarrollo, operación y el mantenimiento
del software (IEEE, 1990).</li>

<li>La ingeniería de Software es la construcción de <span class="underline">productos de
software</span> por grupos de personas, para que san usadas por otras.</li>

<li>El <span class="underline">cliente</span> es quien solicita el desarrollo del producto y
plantea el problema a resolver.</li>

<li>El <span class="underline">equipo de desarrollo construye y entrega</span> el producto
solicitado.</li>
</ul>
</div>
</div>
