content/notas/IS/Notas.org
*** Objetivo de la Ingeniería de Software

    El objetivo según se estableció en la primera conferencia
    importate de Ingeniería de Software en 1968 fue: /"el/
    /establecimiento y uso de principios robustos, orientados a obtener/
    /software *económico* que sea *fiable* y funcione de manera *eficiente*
    sobre máquinas reales"/ (Naur P., 1968).

*** Campo de acción de la Ingeniería de Software

    El campo de acción de la Ingeniería de Software está en el
    desarrollo de producto de software de calidad, apoyándose en
    principios aplicados en los procesos de desarrollo.

*** Relación entre las Matemáticas, Ciencias de la Computación e Ingeniería de Software

    * Las *matemáticas* te facilitasn, a través de la formación mental,
      la bastracción de conceptos, expresión de algoritmo y
      construcción de modelos.

    * Las *Ciencias de la Computación* te proporcionan conocimientos y
      herramientas para hacer programas y fundamentos computacionales
      tales como: conceptos de lenguajes de programación, análisis de
      algoritmos, sistemas operativos, aqrquitectura de computadoras,
      entre otros.

    * Las prácticas de la Ingeniería que ha incorporado la *Ingeniería*
      *de Software* son: especificación de requisitos, diseño y
      organización del trabajo en equipos, entre otros.

*** Software

    * Es el conjunto de programas de cómputo, procedimientos, reglas,
      documentación y datos asociados, que forman parte de las
      operaciones de un sistema de computación. (SECOVAB, 2017)

    * Un producto de software es la suma total de: programas de
      computadora, procedimientos, reglas, documentación asociada y
      datos necesarios para la operación de un sistema
      computarizado. (ISO/IEC 12207, 2008)


    El software hace que el hardware funcione e interactúe con
    nosotros.

** Clase 3

*** Características del software

    - Es abstracto e intangible. No está restringido por las
      propiedades de los materiales, ni las leyes físicas, ni las
      reglas de manufactura. (Sommerville I., 2011)

    - El software se desarrolla, no se fabrica en un sentido clásico
      (Pressman R.S.).

    - Es fácilmente modificable y por lo tanto se puede corromper.

    - Está hecho para evolucionar, pues cambiará según las necesidades
      de sus usuarios.

    - El software no se desgasta con el paso del tiempo pero se ouede
      deteriorar si al mantenerlo se le incorporan nuevos
      defectos. (Pressman R.S.)

*** Tipos de software

    - Sistemas de entretenimiento.
    - Software científico y de simulación de procesos reales.
    - Aplicaciones de red y móviles.
    - Software de almacenamiento de datos.
    - Sistemas de sistemas.
    - Software interactivo.
    - Sistemas de entretenimiento.

*** Calidad de software

    - /Calidad/ de un producto de software es el "grado en que satisface
      las necesidades y expectativas del usuario cuando se usa en
      condiciones específicas". (ISO/IEC 25010, 2009)
      
    - Para obtener software de calidad es necesario que todos los
      productos que se generen en el desarrollo sean consistentes y no
      tengan defectos.

    - Un /defecto/ es resultado de un error cometito por un
      desorrollador al generar un producto.

    - "Los defectos aún pequeños como faltas de ortografía o de ddedo,
      puede cosaionar problemas severos en el software al presentar
      inconsistencias o respuestas impredecibles" (Humphrey W., 1996).

*** Prácticas de calidad

    Se utilizan dos:

    - Verificar un producto de software tiene por objetivo revisar que
      no tenga defectos introducidos por el desarrollador.

    - Validad el software es asegurarse que hace lo que el usuario
      espera que haga.

** Laboratorio 1

*** Glosario de Bases de Datos (MySQL)

    - MySQL: Es un manejador de bases de datos

      + Crear tablas:

	#+begin_src sql
  CREATE TABLE <Nombre_Tabla> (<id> <tipo> [restricciones], <id2> <tipo> [restricciones], ...., [PRIMARY KEY(<id_n>)]);
	#+end_src

      + Borrar tabla:

	#+begin_src sql
  DROP TABLE <Nombre_tabla>;
	#+end_src

      + Actualiza tabla:

	#+begin_src sql
  UPDATE TABLE <Nombre_tabla> (<idx> <tipo>, ...);
	#+end_src

      + Ver tablas:

	#+begin_src sql
  DESCRIBE <Nombre_tabla>;
	#+end_src

      + Insertar

	#+begin_src sql
  INSERT INTO <Nombre_Tabla> VALUES (va1,val2,...);
	#+end_src

      + Update

	#+begin_src sql
  UPDATE <Nombre_Tabla> SET <colx> = <valx>, <coly> = <valy>, ... (WHERE <condicion_booleana>);
	#+end_src

      + Select

	#+begin_src sql

SELECT col1 (AS <nom_sim>), col2, ..., coln FROM <Nombre_tabla> (WHERE <condicion_booleana>);
	#+end_src

      + Delete

	#+begin_src sql
  DELETE FROM <Nombre_tabla> (WHERE <condicion_booleana>);
	#+end_src
    
    - Puertos: Identificador donde se responden o atienden servicios
      (MySQL utiliza el puerto 3306)
      
    - View:
    - ORM

** Clase 4

