notas/IS/Notas.html

<div id="outline-container-org8f5c73a" class="outline-4">
<h4 id="org8f5c73a">Objetivo de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-org8f5c73a">
<p>
El objetivo según se estableció en la primera conferencia
importate de Ingeniería de Software en 1968 fue: <i>"el</i>
<i>establecimiento y uso de principios robustos, orientados a obtener</i>
<i>software <b>económico</b> que sea <b>fiable</b> y funcione de manera <b>eficiente</b>
sobre máquinas reales"</i> (Naur P., 1968).
</p>
</div>
</div>

<div id="outline-container-orgbe72efe" class="outline-4">
<h4 id="orgbe72efe">Campo de acción de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-orgbe72efe">
<p>
El campo de acción de la Ingeniería de Software está en el
desarrollo de producto de software de calidad, apoyándose en
principios aplicados en los procesos de desarrollo.
</p>
</div>
</div>

<div id="outline-container-orgd9a3bca" class="outline-4">
<h4 id="orgd9a3bca">Relación entre las Matemáticas, Ciencias de la Computación e Ingeniería de Software</h4>
<div class="outline-text-4" id="text-orgd9a3bca">
<ul class="org-ul">
<li>Las <b>matemáticas</b> te facilitasn, a través de la formación mental,
la bastracción de conceptos, expresión de algoritmo y
construcción de modelos.</li>

<li>Las <b>Ciencias de la Computación</b> te proporcionan conocimientos y
herramientas para hacer programas y fundamentos computacionales
tales como: conceptos de lenguajes de programación, análisis de
algoritmos, sistemas operativos, aqrquitectura de computadoras,
entre otros.</li>

<li>Las prácticas de la Ingeniería que ha incorporado la <b>Ingeniería</b>
<b>de Software</b> son: especificación de requisitos, diseño y
organización del trabajo en equipos, entre otros.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf70c5d4" class="outline-4">
<h4 id="orgf70c5d4">Software</h4>
<div class="outline-text-4" id="text-orgf70c5d4">
<ul class="org-ul">
<li>Es el conjunto de programas de cómputo, procedimientos, reglas,
documentación y datos asociados, que forman parte de las
operaciones de un sistema de computación. (SECOVAB, 2017)</li>

<li>Un producto de software es la suma total de: programas de
computadora, procedimientos, reglas, documentación asociada y
datos necesarios para la operación de un sistema
computarizado. (ISO/IEC 12207, 2008)</li>
</ul>


<p>
El software hace que el hardware funcione e interactúe con
nosotros.
</p>
</div>
</div>
</div>

<div id="outline-container-org44a4471" class="outline-3">
<h3 id="org44a4471">Clase 3</h3>
<div class="outline-text-3" id="text-org44a4471">
</div>
<div id="outline-container-org5c58607" class="outline-4">
<h4 id="org5c58607">Características del software</h4>
<div class="outline-text-4" id="text-org5c58607">
<ul class="org-ul">
<li>Es abstracto e intangible. No está restringido por las
propiedades de los materiales, ni las leyes físicas, ni las
reglas de manufactura. (Sommerville I., 2011)</li>

<li>El software se desarrolla, no se fabrica en un sentido clásico
(Pressman R.S.).</li>

<li>Es fácilmente modificable y por lo tanto se puede corromper.</li>

<li>Está hecho para evolucionar, pues cambiará según las necesidades
de sus usuarios.</li>

<li>El software no se desgasta con el paso del tiempo pero se ouede
deteriorar si al mantenerlo se le incorporan nuevos
defectos. (Pressman R.S.)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf37be8b" class="outline-4">
<h4 id="orgf37be8b">Tipos de software</h4>
<div class="outline-text-4" id="text-orgf37be8b">
<ul class="org-ul">
<li>Sistemas de entretenimiento.</li>
<li>Software científico y de simulación de procesos reales.</li>
<li>Aplicaciones de red y móviles.</li>
<li>Software de almacenamiento de datos.</li>
<li>Sistemas de sistemas.</li>
<li>Software interactivo.</li>
<li>Sistemas de entretenimiento.</li>
</ul>
</div>
</div>

<div id="outline-container-org03a95b4" class="outline-4">
<h4 id="org03a95b4">Calidad de software</h4>
<div class="outline-text-4" id="text-org03a95b4">
<ul class="org-ul">
<li><i>Calidad</i> de un producto de software es el "grado en que satisface
las necesidades y expectativas del usuario cuando se usa en
condiciones específicas". (ISO/IEC 25010, 2009)</li>

<li>Para obtener software de calidad es necesario que todos los
productos que se generen en el desarrollo sean consistentes y no
tengan defectos.</li>

<li>Un <i>defecto</i> es resultado de un error cometito por un
desorrollador al generar un producto.</li>

<li>"Los defectos aún pequeños como faltas de ortografía o de ddedo,
puede cosaionar problemas severos en el software al presentar
inconsistencias o respuestas impredecibles" (Humphrey W., 1996).</li>
</ul>
</div>
</div>

<div id="outline-container-org3d5d746" class="outline-4">
<h4 id="org3d5d746">Prácticas de calidad</h4>
<div class="outline-text-4" id="text-org3d5d746">
<p>
Se utilizan dos:
</p>

<ul class="org-ul">
<li>Verificar un producto de software tiene por objetivo revisar que
no tenga defectos introducidos por el desarrollador.</li>

<li>Validad el software es asegurarse que hace lo que el usuario
espera que haga.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc2f435b" class="outline-3">
<h3 id="orgc2f435b">Laboratorio 1</h3>
<div class="outline-text-3" id="text-orgc2f435b">
</div>
<div id="outline-container-orgf4d6b59" class="outline-4">
<h4 id="orgf4d6b59">Glosario de Bases de Datos (MySQL)</h4>
<div class="outline-text-4" id="text-orgf4d6b59">
<ul class="org-ul">
<li>MySQL: Es un manejador de bases de datos

<ul class="org-ul">
<li><p>
Crear tablas:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> &lt;Nombre_Tabla&gt; (&lt;id&gt; &lt;tipo&gt; [restricciones], &lt;id2&gt; &lt;tipo&gt; [restricciones], ...., [<span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span>(&lt;id_n&gt;)]);
</pre>
</div></li>

<li><p>
Borrar tabla:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">DROP</span> <span style="font-weight: bold;">TABLE</span> &lt;Nombre_tabla&gt;;
</pre>
</div></li>

<li><p>
Actualiza tabla:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">TABLE</span> &lt;Nombre_tabla&gt; (&lt;idx&gt; &lt;tipo&gt;, ...);
</pre>
</div></li>

<li><p>
Ver tablas:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">DESCRIBE</span> &lt;Nombre_tabla&gt;;
</pre>
</div></li>

<li><p>
Insertar
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> &lt;Nombre_Tabla&gt; <span style="font-weight: bold;">VALUES</span> (va1,val2,...);
</pre>
</div></li>

<li><p>
Update
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">UPDATE</span> &lt;Nombre_Tabla&gt; <span style="font-weight: bold;">SET</span> &lt;colx&gt; = &lt;valx&gt;, &lt;coly&gt; = &lt;valy&gt;, ... (<span style="font-weight: bold;">WHERE</span> &lt;condicion_booleana&gt;);
</pre>
</div></li>

<li><p>
Select
</p>

<div class="org-src-container">
<pre class="src src-sql">
<span style="font-weight: bold;">SELECT</span> col1 (<span style="font-weight: bold;">AS</span> &lt;nom_sim&gt;), col2, ..., coln <span style="font-weight: bold;">FROM</span> &lt;Nombre_tabla&gt; (<span style="font-weight: bold;">WHERE</span> &lt;condicion_booleana&gt;);
</pre>
</div></li>

<li><p>
Delete
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">FROM</span> &lt;Nombre_tabla&gt; (<span style="font-weight: bold;">WHERE</span> &lt;condicion_booleana&gt;);
</pre>
</div></li>
</ul></li>

<li>Puertos: Identificador donde se responden o atienden servicios
(MySQL utiliza el puerto 3306)</li>

<li>View:</li>
<li>ORM</li>
</ul>
</div>
</div>
</div>
