content/notas/IS/Notas.org
*** Cualidades del software

    - *Adecuación funcional*. (Functional suitability) Representa la
      capacidad del producto de software para proporcionar funciones
      que satisfacen las necesidades declaradas e implícitas, cuando
      el producto se usa en las condiciones especificadas.

    - *Eficiencia de Desempeño* (Performance efficiency). Representa el
      desempeño relativo a la cantidad de recursos utilizados, bajo
      determinadas condiciones.

    - *Compatibilidad* (COmpatibility). Capacidad de dos o más sistemas
      o componentes para intercambiar información y/o llevar a cabo
      sus funciones requeridas cuando comparten el mismo entorno de
      hardware o software.

    - *Usabilidad* (Usability). Capacidad del producto de software para
      ser entendido, aprendido, usado y resultar atractivo para el
      usuario, cuando se usa bajo determinadas condiciones.

    - *Fiabilidad* (Reliability). Capacidad de un sistema o componente
      para desempeñar las funciones especificadas, cuando se usa bajo
      unas condiciones y periodo de tiempo determinados.

    - *Seguridad* (Security). Capacidad de protección de la información
      y los datos de manera, que personas o sistemas no autorizados no
      puedan leerlos o modificarlos.

    - *Mantenibilidad* (Mantainabilty). Capacidad del producto de
      software para ser modificado efectiva y eficientemente, debido a
      necesidades evolutivas.

*** Definición de cliente y equipo de desarrollo

    - En la Ingeniería de Software el /cliente/ es quien solicita el
      software. Ese cliente podrías ser tú mismo, otra persona que
      requiere el desarrollo de software, alguien que está dispuesto a
      pagarte para que le construyas un software, etc.

    - El /equipo de desarrollo/ es otro término importante y puede ser
      una sola persona, 2 o 3 o muchas, que se encargan de desarrollar
      y entregal el software al cliente que lo solicitó.

*** Ciclo de vida de software

    - "La evolución que va sufriendo el software desde el momento en
      que se plantea su construcción, el tiempo que lleva su
      desarrollo, la evolución donde se le agregan y modifican
      funcionalidades, hasta su retiro de uso." (IEEE, 1990).

** Clase 5

*** Roles

   - Azul: líder del equipo
   - Rojo: Técnico, ayudar a los integrantes a los demás.
   - Verde: Me la muerde asjjsa
   - Amarillo: Documentos, calidad

** Clase 6

*** Etapa de desarrollo

    - Análisis de requisitos:

      Es el paso en el qie el cliente expresa sus necesidades para
      crear el software y el equipo de desarrollo, al analizarlas, las
      convierte en la especificación de requerimientos del producto de
      software.
      
    - Diseño:

      El equipo de desarrollo, en gunción de la especificación de
      requerimientos establece la estructura del software,
      identificando sus componentes principales con sus relaciones y
      especifica cada componente a detalle.
      
    - Construcción:

      Se genera el código de cada componente siguiente el diseño.
      
    - Integración:

      Se asegura que todos los componentes trabajen adecuadamente
      juntos, haciendo las pruebas.
      
    - Pruebas:
    - Entrega:

*** Principios de la Ingeniería de Software

**** Generalidad

     Descubrir los aspectos más generales que existe en la necesidades
     del software para desarrollar el producto de software más general
     que los cumpla. Este principio es fundamental para desarrollar
     herramientas y paquetes genéricos.

**** Abstracción.

     Identificar los aspectos más importantes e ir cincorporando los
     detalles gradualmente.

**** Modularidad

     Dividir el problema en subproblemas menos complejos. Incluye los
     conceptos de cohesión y acoplamiento: Los subproblemas deben ser
     internamente cohesivos y, en relación a otros, débilmente
     acoplados.

**** Incrementabilidad

     Consiste en obtener el producto de software incrementando la
     funcionalidad a través de varias iteraciones de desarrollo.

**** Anticipación al cambio

     Es diseñar el software para que pueda evolucionar a nuevas
     versiones.

**** Separación de conceptos

     Es manejar diferentas aaspectos de un problema concentrándose en
     cada un por separado.

*** Historia de la Ingeniería de Software

**** La Ingeniería de Software en los 70's

     - A fines de los 60's desarrollar software consistía
       principalmente en codificar y corregir errores (code&fix).

     - Surge la llamada crisis del software, debido a que la mayor
       parte de sistemas de software:

     - No respondía a las necesidades de los clientes.

     - Costaba mucho más caro de lo contratado.

     - No se entregaba en el tiempo planeado.

**** La Ingeniería de Software en los 80's

     - Surgen las Metodologías de desarrollo de software estructuradas.

     - Su objetivo es desarrollar software siguiendo el ciclo de vida
       del software, que consiste en una serie de pasos:

       + Definir los requerimientos para el software

       + Analizarlos

       + Diseñar el software

       + Implementarlo

       + Probarlo

       + Ponerlo a disposición de los usuarios.

     - Entregado al cliente, se le daba mantenimiento:

       - Correcivo: Para eliminar los defectos

       - Adaptativo: Para adecuarlo a las necesidades del usuario.

       - Perfectivo: Para mejorarlo

**** La Ingeniería de Software en los 90's

     - En el 97 se desarrolla el UML
       
     - UML sigue siento el estándar de modelado vigente y el más
       utilizado en la industria de software.
       
     - Modelos de procesos como estándares internacionales.

       - Modelo de Madurez de Capacidades
       - ISO/IEC 12207 y 15504
	 
     - El CMM evolucionó en la siguiente década a CMMI, máximo
       referente en las empresas de desarrollo de software.


     Actualmente CMMI tiene prácticas para el desarrollo de software.

** Clase 7
*** Historia de la Ingeniería de Software

    - Procesos de software: "Un proceso de ingeniería consiste en un
      conjunto de actividades interrelacionadas que transforman una o
      más entradas en salidas. Al realizar la transformación se
      consumen recursos" (SWEBOK 3.0, 2014).

    - Watts Humphrey propuso dos modelos de procesos de apoyo al
      desarrollo de software.
      
