notas/IS/Notas.html

<div id="outline-container-orgeaba026" class="outline-3">
<h3 id="orgeaba026">Clase 4</h3>
<div class="outline-text-3" id="text-orgeaba026">
</div>
<div id="outline-container-org09d2ab4" class="outline-4">
<h4 id="org09d2ab4">Cualidades del software</h4>
<div class="outline-text-4" id="text-org09d2ab4">
<ul class="org-ul">
<li><b>Adecuación funcional</b>. (Functional suitability) Representa la
capacidad del producto de software para proporcionar funciones
que satisfacen las necesidades declaradas e implícitas, cuando
el producto se usa en las condiciones especificadas.</li>

<li><b>Eficiencia de Desempeño</b> (Performance efficiency). Representa el
desempeño relativo a la cantidad de recursos utilizados, bajo
determinadas condiciones.</li>

<li><b>Compatibilidad</b> (COmpatibility). Capacidad de dos o más sistemas
o componentes para intercambiar información y/o llevar a cabo
sus funciones requeridas cuando comparten el mismo entorno de
hardware o software.</li>

<li><b>Usabilidad</b> (Usability). Capacidad del producto de software para
ser entendido, aprendido, usado y resultar atractivo para el
usuario, cuando se usa bajo determinadas condiciones.</li>

<li><b>Fiabilidad</b> (Reliability). Capacidad de un sistema o componente
para desempeñar las funciones especificadas, cuando se usa bajo
unas condiciones y periodo de tiempo determinados.</li>

<li><b>Seguridad</b> (Security). Capacidad de protección de la información
y los datos de manera, que personas o sistemas no autorizados no
puedan leerlos o modificarlos.</li>

<li><b>Mantenibilidad</b> (Mantainabilty). Capacidad del producto de
software para ser modificado efectiva y eficientemente, debido a
necesidades evolutivas.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd5d4e3" class="outline-4">
<h4 id="orgdd5d4e3">Definición de cliente y equipo de desarrollo</h4>
<div class="outline-text-4" id="text-orgdd5d4e3">
<ul class="org-ul">
<li>En la Ingeniería de Software el <i>cliente</i> es quien solicita el
software. Ese cliente podrías ser tú mismo, otra persona que
requiere el desarrollo de software, alguien que está dispuesto a
pagarte para que le construyas un software, etc.</li>

<li>El <i>equipo de desarrollo</i> es otro término importante y puede ser
una sola persona, 2 o 3 o muchas, que se encargan de desarrollar
y entregal el software al cliente que lo solicitó.</li>
</ul>
</div>
</div>

<div id="outline-container-org8cb1583" class="outline-4">
<h4 id="org8cb1583">Ciclo de vida de software</h4>
<div class="outline-text-4" id="text-org8cb1583">
<ul class="org-ul">
<li>"La evolución que va sufriendo el software desde el momento en
que se plantea su construcción, el tiempo que lleva su
desarrollo, la evolución donde se le agregan y modifican
funcionalidades, hasta su retiro de uso." (IEEE, 1990).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgefef69e" class="outline-3">
<h3 id="orgefef69e">Clase 5</h3>
<div class="outline-text-3" id="text-orgefef69e">
</div>
<div id="outline-container-orgf903d8f" class="outline-4">
<h4 id="orgf903d8f">Roles</h4>
<div class="outline-text-4" id="text-orgf903d8f">
<ul class="org-ul">
<li>Azul: líder del equipo</li>
<li>Rojo: Técnico, ayudar a los integrantes a los demás.</li>
<li>Verde: Me la muerde asjjsa</li>
<li>Amarillo: Documentos, calidad</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbd9bfef" class="outline-3">
<h3 id="orgbd9bfef">Clase 6</h3>
<div class="outline-text-3" id="text-orgbd9bfef">
</div>
<div id="outline-container-orgd77e663" class="outline-4">
<h4 id="orgd77e663">Etapa de desarrollo</h4>
<div class="outline-text-4" id="text-orgd77e663">
<ul class="org-ul">
<li><p>
Análisis de requisitos:
</p>

<p>
Es el paso en el qie el cliente expresa sus necesidades para
crear el software y el equipo de desarrollo, al analizarlas, las
convierte en la especificación de requerimientos del producto de
software.
</p></li>

<li><p>
Diseño:
</p>

<p>
El equipo de desarrollo, en gunción de la especificación de
requerimientos establece la estructura del software,
identificando sus componentes principales con sus relaciones y
especifica cada componente a detalle.
</p></li>

<li><p>
Construcción:
</p>

<p>
Se genera el código de cada componente siguiente el diseño.
</p></li>

<li><p>
Integración:
</p>

<p>
Se asegura que todos los componentes trabajen adecuadamente
juntos, haciendo las pruebas.
</p></li>

<li>Pruebas:</li>
<li>Entrega:</li>
</ul>
</div>
</div>

<div id="outline-container-org8543548" class="outline-4">
<h4 id="org8543548">Principios de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-org8543548">
</div>
<ul class="org-ul">
<li><a id="org853678a"></a>Generalidad<br />
<div class="outline-text-5" id="text-org853678a">
<p>
Descubrir los aspectos más generales que existe en la necesidades
del software para desarrollar el producto de software más general
que los cumpla. Este principio es fundamental para desarrollar
herramientas y paquetes genéricos.
</p>
</div>
</li>

<li><a id="org03e2113"></a>Abstracción.<br />
<div class="outline-text-5" id="text-org03e2113">
<p>
Identificar los aspectos más importantes e ir cincorporando los
detalles gradualmente.
</p>
</div>
</li>

<li><a id="org95f71d3"></a>Modularidad<br />
<div class="outline-text-5" id="text-org95f71d3">
<p>
Dividir el problema en subproblemas menos complejos. Incluye los
conceptos de cohesión y acoplamiento: Los subproblemas deben ser
internamente cohesivos y, en relación a otros, débilmente
acoplados.
</p>
</div>
</li>

<li><a id="orgd8a5e94"></a>Incrementabilidad<br />
<div class="outline-text-5" id="text-orgd8a5e94">
<p>
Consiste en obtener el producto de software incrementando la
funcionalidad a través de varias iteraciones de desarrollo.
</p>
</div>
</li>

<li><a id="orga90e86b"></a>Anticipación al cambio<br />
<div class="outline-text-5" id="text-orga90e86b">
<p>
Es diseñar el software para que pueda evolucionar a nuevas
versiones.
</p>
</div>
</li>

<li><a id="org3d0c27b"></a>Separación de conceptos<br />
<div class="outline-text-5" id="text-org3d0c27b">
<p>
Es manejar diferentas aaspectos de un problema concentrándose en
cada un por separado.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org19f02c0" class="outline-4">
<h4 id="org19f02c0">Historia de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-org19f02c0">
</div>
<ul class="org-ul">
<li><a id="orgec7d4ca"></a>La Ingeniería de Software en los 70's<br />
<div class="outline-text-5" id="text-orgec7d4ca">
<ul class="org-ul">
<li>A fines de los 60's desarrollar software consistía
principalmente en codificar y corregir errores (code&amp;fix).</li>

<li>Surge la llamada crisis del software, debido a que la mayor
parte de sistemas de software:</li>

<li>No respondía a las necesidades de los clientes.</li>

<li>Costaba mucho más caro de lo contratado.</li>

<li>No se entregaba en el tiempo planeado.</li>
</ul>
</div>
</li>

<li><a id="org89a6021"></a>La Ingeniería de Software en los 80's<br />
<div class="outline-text-5" id="text-org89a6021">
<ul class="org-ul">
<li>Surgen las Metodologías de desarrollo de software estructuradas.</li>

<li>Su objetivo es desarrollar software siguiendo el ciclo de vida
del software, que consiste en una serie de pasos:

<ul class="org-ul">
<li>Definir los requerimientos para el software</li>

<li>Analizarlos</li>

<li>Diseñar el software</li>

<li>Implementarlo</li>

<li>Probarlo</li>

<li>Ponerlo a disposición de los usuarios.</li>
</ul></li>

<li>Entregado al cliente, se le daba mantenimiento:

<ul class="org-ul">
<li>Correcivo: Para eliminar los defectos</li>

<li>Adaptativo: Para adecuarlo a las necesidades del usuario.</li>

<li>Perfectivo: Para mejorarlo</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org5e463fe"></a>La Ingeniería de Software en los 90's<br />
<div class="outline-text-5" id="text-org5e463fe">
<ul class="org-ul">
<li>En el 97 se desarrolla el UML</li>

<li>UML sigue siento el estándar de modelado vigente y el más
utilizado en la industria de software.</li>

<li>Modelos de procesos como estándares internacionales.

<ul class="org-ul">
<li>Modelo de Madurez de Capacidades</li>
<li>ISO/IEC 12207 y 15504</li>
</ul></li>

<li>El CMM evolucionó en la siguiente década a CMMI, máximo
referente en las empresas de desarrollo de software.</li>
</ul>


<p>
Actualmente CMMI tiene prácticas para el desarrollo de software.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0fbac35" class="outline-3">
<h3 id="org0fbac35">Clase 7</h3>
<div class="outline-text-3" id="text-org0fbac35">
</div>
<div id="outline-container-orgeba05b7" class="outline-4">
<h4 id="orgeba05b7">Historia de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-orgeba05b7">
<ul class="org-ul">
<li>Procesos de software: "Un proceso de ingeniería consiste en un
conjunto de actividades interrelacionadas que transforman una o
más entradas en salidas. Al realizar la transformación se
consumen recursos" (SWEBOK 3.0, 2014).</li>

<li>Watts Humphrey propuso dos modelos de procesos de apoyo al
desarrollo de software.</li>
</ul>
</div>

<ul class="org-ul">
