content/notas/IS/Notas.org
**** La ingeniería de Software en los 2000's

     - Movimiento ágil que publica el Manifiesto por el desarrollo ágil de software

       - Individuos y sus interacciones sobre procesos y herramientas

       - Software funcionando sobre documentación extensiva.

       - Colaboración con el cliente sobre negociación contractual.

       - Respuesta ante el cambio sobre seguir un plan.

     - Ejemplos de metodos ágiles más populares:

       - eXtreme Programming (XP)

       - SCRUM

     - Evolucionan los procesos y estándare internacionales para
       aplicarse a empresas pequeñas surgiendo estándares nacionales
       como:

       - el estándar mexicano MoProSoft (MoProSoft, 2005)

       - ISO/IEC 29110 Basic Profile for VSEs basado en MoProSoft.

     - Tendencia para balancear de los procesos con los métodos
       ágiles. (Bohem, 2004).

**** La ingeniería en el 2010

     Cuerpo de Conocimientos de la Ingeniería de Software (Software ENgineering Body of Knowlegde).

** Clase 8
*** Cuerpo de Conociemientos de la Ingeniería de Software

    Cuerpo de Conociemientos de la Ingeniería de Software (Software
    Engineering Body of Knowledge)

    - Es un compendio recogido por académicos y profesionales, que la
      ejercen en todo el mundo, para ser utilizado en la educación y
      en la práctica.
      
*** Ingeniería de Software como profesión

    La Ingeniería de Software ha crecido tanto que actualmente se han
    reconocido como una actividad profesional y existen carreras
    profesionales completas dentro del área de la Computación que se
    llaman Ingniería de Software.

*** Estándares

**** ¿Qué son?

     Se crean como acuerdos entre grupos de personas, empresas,
     organismos o países para resolver o aminorar algún problema en
     común.

**** ¿De qué sirven?

     Introducen reglas de comportamiento para el bien de las
     comunidades, como por ejemplo, el reglamento de tránsito
     (semáforos, pasos peatonales, multas, ...)

     Lograr ciertos objetivos siguiendo formas de trabajar sugeridas.

     Generar productos, como el estándar USB para conectar y alimentas
     los dispositivos electrónicos.

**** ¿Cómo se nombran?

     Los estándares tienen distintos nombre: normas, procesos,
     modelos, reglamentos o protocolos.

**** SWEBOK 3.0

     Es un cuerpo de conocimiento sobre la Ingeniería de SOftware
     recopilado por la comunidad del os progesionales y académicos,
     con el objetivo principal de integrar y sistematizar los
     contenidos de la Ingeniería de Software y hacerlos disponibles a
     la comunidad mundial.

**** ISO/IEC 19110

     Es un estándar internacional, que contiene la descripción de dos
     procesos: Administración de Proyecto e Impleentación de Software.

     Estos procesos recogen las buenas prácticas ára el desarrollo de
     proyectos de software por organizaciones pequeñas de hasta 25
     personas.

     Está basado en los procesos correspondientes de la norma mexicana
     NMX-059-NYC que es el modelo de procesos MoProSoft.

*** Administración de Proyecto

    Tiene el propósito de organizar el trabajo del equipo de
    desarrollo y vigilar el cumplimiento de las necesidades del
    cliente.

    Contiene las actividades que permiten guiar la colaboración del
    equipo involucrado en el proceso de implementación.

*** Implementación de Software

    Se empieza por entender las necesidades del cliente, analizar
    estas necesidades u expresarlas en forma de reuerimientos para el
    software.

    Una vez entendidos los requerimientos hay que idear el diseño
    arquitectónico de los componentes del sistema, sus relaciones y,
    luego detallarolos asegurándose que se cumplen los requerimientos.

    A partir del diseño se construyen los componentes de software y se
    prueban de manera individual.

    La siguiente actividad es la integración de los componentes y
    probal el sistema integrado, además incluye la correción de
    defectos encontrados.

    Finalmente, se entrega el software funcional acompañado de la
    documentación, que ayuda al cliente a operarlo y a comprenderlo
    para las futuras modificaciones.

*** SCRUM prácticas ágiles

    Es un marco de trabajo que define un conjunto de prácticas y roles
    para organizar el trabajo de desarrollo de software en equipos.

** Clase 9
*** Kuali-Beh

    Una práctica "porporciona una guía del tabajo a realizar, tiene un
    objetivo específico y proporciona una orientación de cómo producir
    un resultado a partir de una entrada. La guía ofrece un conjunto
    de actividades sistemáticas y repetibles, enfocadas alograr el
    objetivo de la práctica y su resultado. Se requieren habilidades y
    conocimientos particulares para seguir la guía de práctica y
    algunas herramientas pueden facilitar su realización" (OMG, 2013)

    Un método es "la articulación de un conjunto coherente,
    consistente y completo de prácticas que tiene el propósito de
    satisfacer las necesidades del cliente, bajo condiciones
    específicas" (OMG, 2013).

    KUALI-BEH describe los conceptos comunes y sus relaciones
    presentes en cualquier proyecto de softwware. Se trata de una
    propuesta mexicana a la solicitud del Object Management Group, la
    cual se fundamenta en el conocimiento y experiencia obtenidos en
    múltiples proyectos, incluyendo la definición de estándares de
    desarrollo de software.

    KUALI-BEH se compone de dos vistas:

    - Vista estática:

      La cual proporciona un marco de trabajo para la definición de
      las diferentes formas de trabajo de los practicantes. Estas
      formas de trabajo son organizadas en métodos compuestos por
      prácticas. Este conocimiento se estructura en una
      infraestructura de método y prácitcas que pueden ser aplicadas
      por los practicantes.

    - Vista operacional:

      Está relacionada con la ejecución de proyecto de software. Esta
      vista proporciona a los practicantes mecanismos para ejecutar y
      adaptar un método con sus prácticas de acuerdo a las necesidades
      de los principales interesados y a un contexto específico.


    Los conceptos de KUELI-BEH se pueden aplicar para definir métodos
    y prácticas de cualquier proyecto de software, independientemente
    del tamaño, complejidad, modelo de ciclo de visa utilzado o
    tecnología.
    
*** UML

    - Lenguaje de Modelado Unificado tiene como proósito visualizar,
      especificar, facilitar la construcción y documentar software
      para su construcción y mantenimiento.
      
    - Uitliza símbolos gráficos para representar conceptos y sus
      relaciones siguiendo una sintaxis de lenguaje gráfico.

    - Ofrece a los desarrolladores varios tipos de diagramas para
      modelar diferentes aspectos y etapas del desarrollo de software.

    - Estos diagramas están clasificados en diagramas de estructura y
      del comportamiento.

