notas/IS/Notas.html
<li><a id="orga22ca34"></a>La ingeniería de Software en los 2000's<br />
<div class="outline-text-5" id="text-orga22ca34">
<ul class="org-ul">
<li>Movimiento ágil que publica el Manifiesto por el desarrollo ágil de software

<ul class="org-ul">
<li>Individuos y sus interacciones sobre procesos y herramientas</li>

<li>Software funcionando sobre documentación extensiva.</li>

<li>Colaboración con el cliente sobre negociación contractual.</li>

<li>Respuesta ante el cambio sobre seguir un plan.</li>
</ul></li>

<li>Ejemplos de metodos ágiles más populares:

<ul class="org-ul">
<li>eXtreme Programming (XP)</li>

<li>SCRUM</li>
</ul></li>

<li>Evolucionan los procesos y estándare internacionales para
aplicarse a empresas pequeñas surgiendo estándares nacionales
como:

<ul class="org-ul">
<li>el estándar mexicano MoProSoft (MoProSoft, 2005)</li>

<li>ISO/IEC 29110 Basic Profile for VSEs basado en MoProSoft.</li>
</ul></li>

<li>Tendencia para balancear de los procesos con los métodos
ágiles. (Bohem, 2004).</li>
</ul>
</div>
</li>

<li><a id="orgee210d6"></a>La ingeniería en el 2010<br />
<div class="outline-text-5" id="text-orgee210d6">
<p>
Cuerpo de Conocimientos de la Ingeniería de Software (Software ENgineering Body of Knowlegde).
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2d014c6" class="outline-3">
<h3 id="org2d014c6">Clase 8</h3>
<div class="outline-text-3" id="text-org2d014c6">
</div>
<div id="outline-container-orgc232f62" class="outline-4">
<h4 id="orgc232f62">Cuerpo de Conociemientos de la Ingeniería de Software</h4>
<div class="outline-text-4" id="text-orgc232f62">
<p>
Cuerpo de Conociemientos de la Ingeniería de Software (Software
Engineering Body of Knowledge)
</p>

<ul class="org-ul">
<li>Es un compendio recogido por académicos y profesionales, que la
ejercen en todo el mundo, para ser utilizado en la educación y
en la práctica.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd327097" class="outline-4">
<h4 id="orgd327097">Ingeniería de Software como profesión</h4>
<div class="outline-text-4" id="text-orgd327097">
<p>
La Ingeniería de Software ha crecido tanto que actualmente se han
reconocido como una actividad profesional y existen carreras
profesionales completas dentro del área de la Computación que se
llaman Ingniería de Software.
</p>
</div>
</div>

<div id="outline-container-org023fe88" class="outline-4">
<h4 id="org023fe88">Estándares</h4>
<div class="outline-text-4" id="text-org023fe88">
</div>
<ul class="org-ul">
<li><a id="orgc8179f2"></a>¿Qué son?<br />
<div class="outline-text-5" id="text-orgc8179f2">
<p>
Se crean como acuerdos entre grupos de personas, empresas,
organismos o países para resolver o aminorar algún problema en
común.
</p>
</div>
</li>

<li><a id="org8cea6ac"></a>¿De qué sirven?<br />
<div class="outline-text-5" id="text-org8cea6ac">
<p>
Introducen reglas de comportamiento para el bien de las
comunidades, como por ejemplo, el reglamento de tránsito
(semáforos, pasos peatonales, multas, &#x2026;)
</p>

<p>
Lograr ciertos objetivos siguiendo formas de trabajar sugeridas.
</p>

<p>
Generar productos, como el estándar USB para conectar y alimentas
los dispositivos electrónicos.
</p>
</div>
</li>

<li><a id="orgcabdad6"></a>¿Cómo se nombran?<br />
<div class="outline-text-5" id="text-orgcabdad6">
<p>
Los estándares tienen distintos nombre: normas, procesos,
modelos, reglamentos o protocolos.
</p>
</div>
</li>

<li><a id="org81d21b6"></a>SWEBOK 3.0<br />
<div class="outline-text-5" id="text-org81d21b6">
<p>
Es un cuerpo de conocimiento sobre la Ingeniería de SOftware
recopilado por la comunidad del os progesionales y académicos,
con el objetivo principal de integrar y sistematizar los
contenidos de la Ingeniería de Software y hacerlos disponibles a
la comunidad mundial.
</p>
</div>
</li>

<li><a id="orgc1309a3"></a>ISO/IEC 19110<br />
<div class="outline-text-5" id="text-orgc1309a3">
<p>
Es un estándar internacional, que contiene la descripción de dos
procesos: Administración de Proyecto e Impleentación de Software.
</p>

<p>
Estos procesos recogen las buenas prácticas ára el desarrollo de
proyectos de software por organizaciones pequeñas de hasta 25
personas.
</p>

<p>
Está basado en los procesos correspondientes de la norma mexicana
NMX-059-NYC que es el modelo de procesos MoProSoft.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge0fb16a" class="outline-4">
<h4 id="orge0fb16a">Administración de Proyecto</h4>
<div class="outline-text-4" id="text-orge0fb16a">
<p>
Tiene el propósito de organizar el trabajo del equipo de
desarrollo y vigilar el cumplimiento de las necesidades del
cliente.
</p>

<p>
Contiene las actividades que permiten guiar la colaboración del
equipo involucrado en el proceso de implementación.
</p>
</div>
</div>

<div id="outline-container-org370f34b" class="outline-4">
<h4 id="org370f34b">Implementación de Software</h4>
<div class="outline-text-4" id="text-org370f34b">
<p>
Se empieza por entender las necesidades del cliente, analizar
estas necesidades u expresarlas en forma de reuerimientos para el
software.
</p>

<p>
Una vez entendidos los requerimientos hay que idear el diseño
arquitectónico de los componentes del sistema, sus relaciones y,
luego detallarolos asegurándose que se cumplen los requerimientos.
</p>

<p>
A partir del diseño se construyen los componentes de software y se
prueban de manera individual.
</p>

<p>
La siguiente actividad es la integración de los componentes y
probal el sistema integrado, además incluye la correción de
defectos encontrados.
</p>

<p>
Finalmente, se entrega el software funcional acompañado de la
documentación, que ayuda al cliente a operarlo y a comprenderlo
para las futuras modificaciones.
</p>
</div>
</div>

<div id="outline-container-org7b37b9f" class="outline-4">
<h4 id="org7b37b9f">SCRUM prácticas ágiles</h4>
<div class="outline-text-4" id="text-org7b37b9f">
<p>
Es un marco de trabajo que define un conjunto de prácticas y roles
para organizar el trabajo de desarrollo de software en equipos.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf7095df" class="outline-3">
<h3 id="orgf7095df">Clase 9</h3>
<div class="outline-text-3" id="text-orgf7095df">
</div>
<div id="outline-container-org3d62d32" class="outline-4">
<h4 id="org3d62d32">Kuali-Beh</h4>
<div class="outline-text-4" id="text-org3d62d32">
<p>
Una práctica "porporciona una guía del tabajo a realizar, tiene un
objetivo específico y proporciona una orientación de cómo producir
un resultado a partir de una entrada. La guía ofrece un conjunto
de actividades sistemáticas y repetibles, enfocadas alograr el
objetivo de la práctica y su resultado. Se requieren habilidades y
conocimientos particulares para seguir la guía de práctica y
algunas herramientas pueden facilitar su realización" (OMG, 2013)
</p>

<p>
Un método es "la articulación de un conjunto coherente,
consistente y completo de prácticas que tiene el propósito de
satisfacer las necesidades del cliente, bajo condiciones
específicas" (OMG, 2013).
</p>

<p>
KUALI-BEH describe los conceptos comunes y sus relaciones
presentes en cualquier proyecto de softwware. Se trata de una
propuesta mexicana a la solicitud del Object Management Group, la
cual se fundamenta en el conocimiento y experiencia obtenidos en
múltiples proyectos, incluyendo la definición de estándares de
desarrollo de software.
</p>

<p>
KUALI-BEH se compone de dos vistas:
</p>

<ul class="org-ul">
<li><p>
Vista estática:
</p>

<p>
La cual proporciona un marco de trabajo para la definición de
las diferentes formas de trabajo de los practicantes. Estas
formas de trabajo son organizadas en métodos compuestos por
prácticas. Este conocimiento se estructura en una
infraestructura de método y prácitcas que pueden ser aplicadas
por los practicantes.
</p></li>

<li><p>
Vista operacional:
</p>

<p>
Está relacionada con la ejecución de proyecto de software. Esta
vista proporciona a los practicantes mecanismos para ejecutar y
adaptar un método con sus prácticas de acuerdo a las necesidades
de los principales interesados y a un contexto específico.
</p></li>
</ul>


<p>
Los conceptos de KUELI-BEH se pueden aplicar para definir métodos
y prácticas de cualquier proyecto de software, independientemente
del tamaño, complejidad, modelo de ciclo de visa utilzado o
tecnología.
</p>
</div>
</div>

<div id="outline-container-org3b6872f" class="outline-4">
<h4 id="org3b6872f">UML</h4>
<div class="outline-text-4" id="text-org3b6872f">
<ul class="org-ul">
<li>Lenguaje de Modelado Unificado tiene como proósito visualizar,
especificar, facilitar la construcción y documentar software
para su construcción y mantenimiento.</li>

<li>Uitliza símbolos gráficos para representar conceptos y sus
relaciones siguiendo una sintaxis de lenguaje gráfico.</li>

<li>Ofrece a los desarrolladores varios tipos de diagramas para
modelar diferentes aspectos y etapas del desarrollo de software.</li>

<li>Estos diagramas están clasificados en diagramas de estructura y
del comportamiento.</li>
</ul>
</div>

<ul class="org-ul">
