content/notas/IS/Notas.org
**** Diagramas de estructura      

     Los diagramas de estructura muestran los elementos de los que se
     compone el software y sus relaciones en diferentes niveles de
     abstracción.

     - Clases son bloques de construcción básicos (Diagrama de clases).
     - Paquetes es un mecasimo para agrupar a los diagramas de clases
       en una estructura más abstracta (Diagrama de paquetes).
     - Distribución sirven para visualizar como el software va a ser
       distribuido entre los elementos físicos (/hardware/) del sistema
       de software. (Diagrama de distribución)

**** Diagramas del comportamiento

     Éstos muestran como interaccionan estos elementos a los largo del
     tiempo para proporcionar una funcionalidad.

     - Casos de uso especifican el resultado de la interacción entre
       un actor (usuario u otro sistema) y el sistema de software
       mismo. (Diagrama de casos de uso).
     - Secuencia muestran la interacción de envío de mensajes entre
       los objetos de las clases del sistema. (Diagrama de secuencia)
     - Estados representan las máquinas de estados finitos que ayudan
       a modelar diferentes aspectos del comportamiento dinámico del
       sistema badado en cambio de estados a raíz de eventos (Diagrama
       de navegación).

** Clase 10
*** Métodos y prácticas a utilizar
    
**** /Método Inicial de Desarrollo de Software/ *(MIDS)*

     - Para este curso, hemos definido el método que se llama Método
       Inicial de Desarrollo de Software (MIDS). Este método está
       basado en el estándar *ISO/IEC 29110 Perfil Básico* porlo que
       sigue de los dos procesos de desarrollo que se definen para
       este perfil.
       
     - Los nombres de las prácticas que conformal el método
       corresponden a las actividades de estos dos procesos y se
       agregaron unas prácticas sociales para facilitar el trabajo en
       equipo.

***** Prácticas del MIDS

****** Practicas Sociales

       - Conformar el equipo

       - Definir la comunicación en el equipo

       - Crear el repositorio commún de documentos

       - Retrospectiva de la iteración

****** Prácticas Administrativas

       Éstas están basadas en el proceso de /Administración de Proyecto/
       de la ISO/IEC 29110 y se aplican algunos de los conceptos ágiles
       de SCRUM.

       - Planificar el proyecto

       - Planificar la iteración

       - Ejecutar el plan de iteración

       - Evaluar y controlar la iteración

       - Cerrar la iteración

       - Cerrar el proyecto

****** Prácticas para el Desarrollo

       Están basadas en el proceso de /Implementación de Software/ de la
       ISO/IEC 29110.

       - Requerimientos de software
	
       - Diseño de software

       - Integración y pruebas de software

       - Prueba de Aceptación del Software

***** Apoyos al MIDS

      - Presentaciones
      - Guión del curso
      - Planteamineto de Necesidades
      - Plantillas

***** Roles para miembros del equipo

      - Las prácticas tiene actividades que los miembros del equipo
        tendrán que ejecutar, a veces en equipo y a veces de manera
        individual.

      - Para saber quién va a ser responsable por ejecutar qué
        actividad vamos a definir cinco roles que se asignarán a los
        miembros del equipo. Cada rol tiene definido su objetivo, las
        habilidades que se requieren para desempeñarlo y sus
        responsabilidades.

****** Desarrollador
******* Objetivo

	- Participar en la ejecución de todas las prácticas del
          desarrollo de software.
	  
******* Habilidades

	- Tener conocimientos y experiencia en programación,
          estructuras de datos y bases de datos.

******* Responsabilidades

	- Entender los requisitos del software, participar en la
          especificación de requerimientos, el diseño, la
          construcción, integración y pruebas del software.
	  
	- Participar en las reuniones de trabajo.

	- Revisar y corregir los productos de los que sea
          resoponsable.

	- Aplicar los estándares solicitados.

****** Responsable del equipo
******* Objetivo

	- Mantener motivados a todos los miembros del equipo para que
          participen activamente en el proyecto y trabajen en armonía.
	  
******* Habilidades

	- Sociable y amistoso
	- Es un líder natural en los grupos
	- No conflictivo, sabe motiva a los demás.
	- No es impositivo sino conciliador, pero intolerante a faltas
          de compromiso.

******* Responsabilidades

	- Construye y mantiene la cohesión del equipo y su efectividad.
	- Motiva a los miembros a trabajar en equipo y cumplir sus compromisos.
	- Ayuda a resolver los conflicto que se presenten en el
          equipo. Si no lo logra, los comunica al docente de manera
          oportuna para que ayude a resolverlos.
	- Convoca y dirife las reuniones del equipo.
	- Coordina la retrospectiva de la iteración.

****** Responsable técnico
******* Objetivo

	- Lograr que los resultados del equipo sean de la mejor calidad técnica.
	  
******* Habilidades

	- Experiencia en programación.
	- Reconocimiento del equipo por sus habilidades técnicas.
	- Conocimientos de lenguajes de programación, ambientes de
          programación y herramientas de apoyo.

******* Responsabilidades

	- Dirigir al equipo en la toma de decisiones en las
          actividades técnicas de desarrollo.
	- Aprovechar al máximo las habilidades y los conocimientos en
          programación de los miembros del equipo.
	- Ayudar a los miembros del equipo en la solución de problemas
          técnicos.
	- Seleccionar las herramientas necesarias para el trabajo.
	- Entrenar a los miembros del equipo en el uso de las
          herramientas que trabajarán.
	- Coordinar la integración del código de los desarrolladores.

****** Responsable de la calidad
******* Objetivos

	- Asegurar que se sigan los estándares establecidos para cada
          producto.
	  
******* Habilidades

	- Persona ordenada e interesada en la calidad del software.
	- Saber hacer buenas revisiones y pruebas a los productos.

******* Responsabilidades

	- Coordinar la integración de los documentos de todas las
          actividades del desarrollo apoyado por los demás roles.
	- Encontrar los defectos y vigilar a que se corrijan.
	- No permitir que se hagan cambios no autorizados a productos
          ya aprobados.
	- Coordinar las pruebas y revisiones del producto de software.

****** Responsable de la colaboración
