notas/IS/Notas.html
<li><a id="orge076a14"></a>Diagramas de estructura<br />
<div class="outline-text-5" id="text-orge076a14">
<p>
Los diagramas de estructura muestran los elementos de los que se
compone el software y sus relaciones en diferentes niveles de
abstracción.
</p>

<ul class="org-ul">
<li>Clases son bloques de construcción básicos (Diagrama de clases).</li>
<li>Paquetes es un mecasimo para agrupar a los diagramas de clases
en una estructura más abstracta (Diagrama de paquetes).</li>
<li>Distribución sirven para visualizar como el software va a ser
distribuido entre los elementos físicos (<i>hardware</i>) del sistema
de software. (Diagrama de distribución)</li>
</ul>
</div>
</li>

<li><a id="org2a1a718"></a>Diagramas del comportamiento<br />
<div class="outline-text-5" id="text-org2a1a718">
<p>
Éstos muestran como interaccionan estos elementos a los largo del
tiempo para proporcionar una funcionalidad.
</p>

<ul class="org-ul">
<li>Casos de uso especifican el resultado de la interacción entre
un actor (usuario u otro sistema) y el sistema de software
mismo. (Diagrama de casos de uso).</li>
<li>Secuencia muestran la interacción de envío de mensajes entre
los objetos de las clases del sistema. (Diagrama de secuencia)</li>
<li>Estados representan las máquinas de estados finitos que ayudan
a modelar diferentes aspectos del comportamiento dinámico del
sistema badado en cambio de estados a raíz de eventos (Diagrama
de navegación).</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6d03bdb" class="outline-3">
<h3 id="org6d03bdb">Clase 10</h3>
<div class="outline-text-3" id="text-org6d03bdb">
</div>
<div id="outline-container-orgf6ca190" class="outline-4">
<h4 id="orgf6ca190">Métodos y prácticas a utilizar</h4>
<div class="outline-text-4" id="text-orgf6ca190">
</div>
<ul class="org-ul">
<li><a id="orgb00b000"></a><i>Método Inicial de Desarrollo de Software</i> <b>(MIDS)</b><br />
<div class="outline-text-5" id="text-orgb00b000">
<ul class="org-ul">
<li>Para este curso, hemos definido el método que se llama Método
Inicial de Desarrollo de Software (MIDS). Este método está
basado en el estándar <b>ISO/IEC 29110 Perfil Básico</b> porlo que
sigue de los dos procesos de desarrollo que se definen para
este perfil.</li>

<li>Los nombres de las prácticas que conformal el método
corresponden a las actividades de estos dos procesos y se
agregaron unas prácticas sociales para facilitar el trabajo en
equipo.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org0e443c4"></a>Prácticas del MIDS<br />
<ul class="org-ul">
<li><a id="org14287ff"></a>Practicas Sociales<br />
<div class="outline-text-7" id="text-org14287ff">
<ul class="org-ul">
<li>Conformar el equipo</li>

<li>Definir la comunicación en el equipo</li>

<li>Crear el repositorio commún de documentos</li>

<li>Retrospectiva de la iteración</li>
</ul>
</div>
</li>

<li><a id="orgb62d451"></a>Prácticas Administrativas<br />
<div class="outline-text-7" id="text-orgb62d451">
<p>
Éstas están basadas en el proceso de <i>Administración de Proyecto</i>
de la ISO/IEC 29110 y se aplican algunos de los conceptos ágiles
de SCRUM.
</p>

<ul class="org-ul">
<li>Planificar el proyecto</li>

<li>Planificar la iteración</li>

<li>Ejecutar el plan de iteración</li>

<li>Evaluar y controlar la iteración</li>

<li>Cerrar la iteración</li>

<li>Cerrar el proyecto</li>
</ul>
</div>
</li>

<li><a id="orgd4d2b71"></a>Prácticas para el Desarrollo<br />
<div class="outline-text-7" id="text-orgd4d2b71">
<p>
Están basadas en el proceso de <i>Implementación de Software</i> de la
ISO/IEC 29110.
</p>

<ul class="org-ul">
<li>Requerimientos de software</li>

<li>Diseño de software</li>

<li>Integración y pruebas de software</li>

<li>Prueba de Aceptación del Software</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org8c4d9f4"></a>Apoyos al MIDS<br />
<div class="outline-text-6" id="text-org8c4d9f4">
<ul class="org-ul">
<li>Presentaciones</li>
<li>Guión del curso</li>
<li>Planteamineto de Necesidades</li>
<li>Plantillas</li>
</ul>
</div>
</li>

<li><a id="orgd8ecab7"></a>Roles para miembros del equipo<br />
<div class="outline-text-6" id="text-orgd8ecab7">
<ul class="org-ul">
<li>Las prácticas tiene actividades que los miembros del equipo
tendrán que ejecutar, a veces en equipo y a veces de manera
individual.</li>

<li>Para saber quién va a ser responsable por ejecutar qué
actividad vamos a definir cinco roles que se asignarán a los
miembros del equipo. Cada rol tiene definido su objetivo, las
habilidades que se requieren para desempeñarlo y sus
responsabilidades.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgb771f9d"></a>Desarrollador<br />
<ul class="org-ul">
<li><a id="org5472803"></a>Objetivo<br />
<div class="outline-text-8" id="text-org5472803">
<ul class="org-ul">
<li>Participar en la ejecución de todas las prácticas del
desarrollo de software.</li>
</ul>
</div>
</li>

<li><a id="orgcd98a23"></a>Habilidades<br />
<div class="outline-text-8" id="text-orgcd98a23">
<ul class="org-ul">
<li>Tener conocimientos y experiencia en programación,
estructuras de datos y bases de datos.</li>
</ul>
</div>
</li>

<li><a id="org81773c2"></a>Responsabilidades<br />
<div class="outline-text-8" id="text-org81773c2">
<ul class="org-ul">
<li>Entender los requisitos del software, participar en la
especificación de requerimientos, el diseño, la
construcción, integración y pruebas del software.</li>

<li>Participar en las reuniones de trabajo.</li>

<li>Revisar y corregir los productos de los que sea
resoponsable.</li>

<li>Aplicar los estándares solicitados.</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org1de927d"></a>Responsable del equipo<br />
<ul class="org-ul">
<li><a id="org1ed5889"></a>Objetivo<br />
<div class="outline-text-8" id="text-org1ed5889">
<ul class="org-ul">
<li>Mantener motivados a todos los miembros del equipo para que
participen activamente en el proyecto y trabajen en armonía.</li>
</ul>
</div>
</li>

<li><a id="orgad53894"></a>Habilidades<br />
<div class="outline-text-8" id="text-orgad53894">
<ul class="org-ul">
<li>Sociable y amistoso</li>
<li>Es un líder natural en los grupos</li>
<li>No conflictivo, sabe motiva a los demás.</li>
<li>No es impositivo sino conciliador, pero intolerante a faltas
de compromiso.</li>
</ul>
</div>
</li>

<li><a id="org6ddbbb4"></a>Responsabilidades<br />
<div class="outline-text-8" id="text-org6ddbbb4">
<ul class="org-ul">
<li>Construye y mantiene la cohesión del equipo y su efectividad.</li>
<li>Motiva a los miembros a trabajar en equipo y cumplir sus compromisos.</li>
<li>Ayuda a resolver los conflicto que se presenten en el
equipo. Si no lo logra, los comunica al docente de manera
oportuna para que ayude a resolverlos.</li>
<li>Convoca y dirife las reuniones del equipo.</li>
<li>Coordina la retrospectiva de la iteración.</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org28e1b2f"></a>Responsable técnico<br />
<ul class="org-ul">
<li><a id="org2e1d106"></a>Objetivo<br />
<div class="outline-text-8" id="text-org2e1d106">
<ul class="org-ul">
<li>Lograr que los resultados del equipo sean de la mejor calidad técnica.</li>
</ul>
</div>
</li>

<li><a id="org5398dfd"></a>Habilidades<br />
<div class="outline-text-8" id="text-org5398dfd">
<ul class="org-ul">
<li>Experiencia en programación.</li>
<li>Reconocimiento del equipo por sus habilidades técnicas.</li>
<li>Conocimientos de lenguajes de programación, ambientes de
programación y herramientas de apoyo.</li>
</ul>
</div>
</li>

<li><a id="org10b2978"></a>Responsabilidades<br />
<div class="outline-text-8" id="text-org10b2978">
<ul class="org-ul">
<li>Dirigir al equipo en la toma de decisiones en las
actividades técnicas de desarrollo.</li>
<li>Aprovechar al máximo las habilidades y los conocimientos en
programación de los miembros del equipo.</li>
<li>Ayudar a los miembros del equipo en la solución de problemas
técnicos.</li>
<li>Seleccionar las herramientas necesarias para el trabajo.</li>
<li>Entrenar a los miembros del equipo en el uso de las
herramientas que trabajarán.</li>
<li>Coordinar la integración del código de los desarrolladores.</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org2b85d75"></a>Responsable de la calidad<br />
<ul class="org-ul">
<li><a id="org0e77307"></a>Objetivos<br />
<div class="outline-text-8" id="text-org0e77307">
<ul class="org-ul">
<li>Asegurar que se sigan los estándares establecidos para cada
producto.</li>
</ul>
</div>
</li>

<li><a id="org1a0b00d"></a>Habilidades<br />
<div class="outline-text-8" id="text-org1a0b00d">
<ul class="org-ul">
<li>Persona ordenada e interesada en la calidad del software.</li>
<li>Saber hacer buenas revisiones y pruebas a los productos.</li>
</ul>
</div>
</li>

<li><a id="org1e7e82f"></a>Responsabilidades<br />
<div class="outline-text-8" id="text-org1e7e82f">
<ul class="org-ul">
<li>Coordinar la integración de los documentos de todas las
actividades del desarrollo apoyado por los demás roles.</li>
<li>Encontrar los defectos y vigilar a que se corrijan.</li>
<li>No permitir que se hagan cambios no autorizados a productos
ya aprobados.</li>
<li>Coordinar las pruebas y revisiones del producto de software.</li>
</ul>
</div>
</li>
</ul>
</li>
