content/notas/IS/Notas.org
******* Objetivo

	- Apoyar el trabajo colaborativo del equipo mediante uso de
          herramientas para la comunicación, la coordinación del
          trabajo y los repositorios comparitdos de documentos y del
          código.
	  
******* Habilidades

	- Conocedor de redes sociales y repositorios compartidos.
	- Entrusiasmo en aprender el uso de repositorios y explicar al
          equipo su uso.
	- Disciplinado en el manejo de repositorios comunes de
          documentos y del código para facilitar la comunicación
          asíncrona del equipo.

******* Responsabilidades

	- Seleccionar las herramientas necesarias para apoyar al
          equipo en la comunicación y coordinación.
	- Crear y mantener los repositorios comunes de documentos y de
          código.
	- Ayudar en la coordinación de la realización de las
          actividades de administración del proyecto manteniendo
          actualizando el contenido de la herramienta de coordinación
          según las actividades realizadas por el equipo.

** Clase 11
*** Concepto de equipo

    - Es "un número reducido de personas con habilidades
      complementarias que están comprometidas con un propósito común,
      tienen metas de desmpeño y un enfoque común del que son
      mutuamente responsables".

    - En Ingeniería de Software, un "equipo de trabajo es un grupo de
      practicantes que trabajan juntos de manera colaborativa durante
      un periodo de tiempo, para obtener el objetivo específico de
      construir un producto de software".
      
*** Tamaño de un equipo

    - SCRUM para el desarrollo de software el tamaño ideal del equipo
      es entre 3 y 9 personas.

** Clase 12
*** Práctoca Social 1. Conformación del equipo
    
**** Objetivos

     - Dar la identidad al equipo con un nombre y logo.
     - Repartir los roles entre los miembros del equipo según sus habilidades.
     - Entender las características del producto de software a
       desarrollar y asignarle un nombre.

**** Entrada

***** Condiciones

      - Grupo de 3 a 5 alumnos del curso de Ingeniería de Software que
        conformará el equipo de trabajo.
      - Todos han entendido el método MIDS que se va a seguir en el
        curso.

***** Productos de trabajo

      - Plantemiento de Necesidades
      - Guión del Curso
      - Plantillas

**** Resultado

***** Condiciones

      - Equipo conformado
	
	- Identificado con nombre y logo.

	- Cada participante del equipo conoce su rol y sus responsabilidades.

	- Todos entienden las características del producto de software
          a desarrollar y eligieron su nombre.

***** Productos de trabajo

      - Primer proyecto de software
	
	- Plantilla personalizada con los daros del equipo y proyecto.

***** Actividades

      1. Definir el nombre y logo del equipo.
      2. Repartir los roles.
      3. Prpponer el nombre al producto de software en función de su
         objetivo.
      4. Generar la plantilla personalizada del /Primer proyecto de
         software/ con los datos del proyecto.

****** Técnica para definir el nombre y logo del equipo.
       - Una primera reunión de todo el equipo. Al llegar a la reunión
         cada persona deberá tener:

	 - Por lo menos una propuesta de nombre para el equipo.

	 - Por lo menos una propuesta de dibujo para el logo que
           corresponde al nombre.

       - Al llegar a la reunión, cada alumno propone sus nombres y
         logos explicándolos a sus compañeros.

       - Todos votan por una de las propuestas nombre-logo.

       - La que tenga más votos gana.

       - Si hay empate entre 2 propuestas, se explican los votos a
         favor de ambas propuestas y se repite el procedimiento. Si no
         se logra desempate, se puede echar un volado.

       - La persona cuya propuesta ganó refina la representación
         gráfica del logo con el nombre utilizando una herramienta
         gráfica e incorporando las sugerencias de sus compañeros
         acordadas por todos.

****** Técnica para repartir los roles
       - Hay cinco roles:

	 - Desarrollador, que serán todos los miembros del equipo.

	 - Responsable del equipo

	 - Responsable técnico

	 - Responsable de la calidad

	 - Responsable de la colaboración

       - Para repartir los roles se toman en cuenta las habilidades e
         intereses de los miembros del equipo.

       - Reunión del equipo:

	 - Cada alumno se presenta con su nombre, pasatiempos
           favoritos y una pequeña descripción de su personalidad.

	 - Luego, cada uno expone su lista de preferencias de roles y
           argumenta las razones por las que le gustaría jugar su rol
           preferente.

	 - Cuando dos miembros del equipo quieran jugar un mismo rol,
           tratar de convencer al equipo.

	 - Si se mantiene el empate, se puede resolver con un volado.

       - Si el equipo tiene 5 personas la comunicación y la
         coordinación entre ellas se complica.

       - Se reparten en dos los roles de colaboración:

	 - Uno se encarga del seguimiento del Tablero

	 - Otro se encarga del manejo de repositorios y las versiones
           de los documentos y código.

****** Técnica para proponer el nombre al producto de software

       - Todos los miembros del equipo deben leer el documento de
         Planteamiento de Necesidades y comentarlo entre ellos. En
         caso de dudas deben solicitar las aclaraciones al docente.
	 
       - Una vez entendido el objetivo del software todos proponen el
         nombre al sistema a desarrollar y lo seleccionan en votación.

****** Técnica para generar la plantilla personalizada del Primer proyecto de software
       - El responsable de la calidad personaliza e integra la
         plantilla de la Portada de los documentos y la plantilla del
         /Primer proyecto de software/ colocando el logo y el nombre del
         equipo. En todas las plantillas los textos marcados en azul
         son los que tendrán que sustituirse por información generada
         por el equipo.

       - El responsable de la calidad documenta los nombres de los
         miembros del equpo con sus roles seleccionados y el nombre
         del docente en la plantilla personalizada para el /Primer
         proyecto de software/. En el mismo documento pone las
         referencias al documento de /Planteamiento de Necesidades/ y al
         Guion del curso, así como las fechas de inicio y del fin del
         proyecto indicadas en el guion.

*** Práctica Social 2. Definición de la comunicación en el equipo

**** Objetivos

     - Establecer las formas de comunicación síncrona del equipo para el proyecto.

**** Entrada

***** Condiciones

      - Equipo conformado

