notas/IS/Notas.html

<li><a id="orgc65832a"></a>Responsable de la colaboración<br />
<ul class="org-ul">
<li><a id="org99db1ec"></a>Objetivo<br />
<div class="outline-text-8" id="text-org99db1ec">
<ul class="org-ul">
<li>Apoyar el trabajo colaborativo del equipo mediante uso de
herramientas para la comunicación, la coordinación del
trabajo y los repositorios comparitdos de documentos y del
código.</li>
</ul>
</div>
</li>

<li><a id="org420c186"></a>Habilidades<br />
<div class="outline-text-8" id="text-org420c186">
<ul class="org-ul">
<li>Conocedor de redes sociales y repositorios compartidos.</li>
<li>Entrusiasmo en aprender el uso de repositorios y explicar al
equipo su uso.</li>
<li>Disciplinado en el manejo de repositorios comunes de
documentos y del código para facilitar la comunicación
asíncrona del equipo.</li>
</ul>
</div>
</li>

<li><a id="orgb0d1fba"></a>Responsabilidades<br />
<div class="outline-text-8" id="text-orgb0d1fba">
<ul class="org-ul">
<li>Seleccionar las herramientas necesarias para apoyar al
equipo en la comunicación y coordinación.</li>
<li>Crear y mantener los repositorios comunes de documentos y de
código.</li>
<li>Ayudar en la coordinación de la realización de las
actividades de administración del proyecto manteniendo
actualizando el contenido de la herramienta de coordinación
según las actividades realizadas por el equipo.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5e6c3c1" class="outline-3">
<h3 id="org5e6c3c1">Clase 11</h3>
<div class="outline-text-3" id="text-org5e6c3c1">
</div>
<div id="outline-container-org8fbf516" class="outline-4">
<h4 id="org8fbf516">Concepto de equipo</h4>
<div class="outline-text-4" id="text-org8fbf516">
<ul class="org-ul">
<li>Es "un número reducido de personas con habilidades
complementarias que están comprometidas con un propósito común,
tienen metas de desmpeño y un enfoque común del que son
mutuamente responsables".</li>

<li>En Ingeniería de Software, un "equipo de trabajo es un grupo de
practicantes que trabajan juntos de manera colaborativa durante
un periodo de tiempo, para obtener el objetivo específico de
construir un producto de software".</li>
</ul>
</div>
</div>

<div id="outline-container-org2a6c00e" class="outline-4">
<h4 id="org2a6c00e">Tamaño de un equipo</h4>
<div class="outline-text-4" id="text-org2a6c00e">
<ul class="org-ul">
<li>SCRUM para el desarrollo de software el tamaño ideal del equipo
es entre 3 y 9 personas.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga635aff" class="outline-3">
<h3 id="orga635aff">Clase 12</h3>
<div class="outline-text-3" id="text-orga635aff">
</div>
<div id="outline-container-org3fec249" class="outline-4">
<h4 id="org3fec249">Práctoca Social 1. Conformación del equipo</h4>
<div class="outline-text-4" id="text-org3fec249">
</div>
<ul class="org-ul">
<li><a id="org47a7faa"></a>Objetivos<br />
<div class="outline-text-5" id="text-org47a7faa">
<ul class="org-ul">
<li>Dar la identidad al equipo con un nombre y logo.</li>
<li>Repartir los roles entre los miembros del equipo según sus habilidades.</li>
<li>Entender las características del producto de software a
desarrollar y asignarle un nombre.</li>
</ul>
</div>
</li>

<li><a id="orgf3e63d1"></a>Entrada<br />
<ul class="org-ul">
<li><a id="org3143993"></a>Condiciones<br />
<div class="outline-text-6" id="text-org3143993">
<ul class="org-ul">
<li>Grupo de 3 a 5 alumnos del curso de Ingeniería de Software que
conformará el equipo de trabajo.</li>
<li>Todos han entendido el método MIDS que se va a seguir en el
curso.</li>
</ul>
</div>
</li>

<li><a id="orgc220ba2"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-orgc220ba2">
<ul class="org-ul">
<li>Plantemiento de Necesidades</li>
<li>Guión del Curso</li>
<li>Plantillas</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org5623518"></a>Resultado<br />
<ul class="org-ul">
<li><a id="org90b39b1"></a>Condiciones<br />
<div class="outline-text-6" id="text-org90b39b1">
<ul class="org-ul">
<li>Equipo conformado

<ul class="org-ul">
<li>Identificado con nombre y logo.</li>

<li>Cada participante del equipo conoce su rol y sus responsabilidades.</li>

<li>Todos entienden las características del producto de software
a desarrollar y eligieron su nombre.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgebc1c7f"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-orgebc1c7f">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Plantilla personalizada con los daros del equipo y proyecto.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org618b89c"></a>Actividades<br />
<div class="outline-text-6" id="text-org618b89c">
<ol class="org-ol">
<li>Definir el nombre y logo del equipo.</li>
<li>Repartir los roles.</li>
<li>Prpponer el nombre al producto de software en función de su
objetivo.</li>
<li>Generar la plantilla personalizada del <i>Primer proyecto de
software</i> con los datos del proyecto.</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="orgea70816"></a>Técnica para definir el nombre y logo del equipo.<br />
<div class="outline-text-7" id="text-orgea70816">
<ul class="org-ul">
<li>Una primera reunión de todo el equipo. Al llegar a la reunión
cada persona deberá tener:

<ul class="org-ul">
<li>Por lo menos una propuesta de nombre para el equipo.</li>

<li>Por lo menos una propuesta de dibujo para el logo que
corresponde al nombre.</li>
</ul></li>

<li>Al llegar a la reunión, cada alumno propone sus nombres y
logos explicándolos a sus compañeros.</li>

<li>Todos votan por una de las propuestas nombre-logo.</li>

<li>La que tenga más votos gana.</li>

<li>Si hay empate entre 2 propuestas, se explican los votos a
favor de ambas propuestas y se repite el procedimiento. Si no
se logra desempate, se puede echar un volado.</li>

<li>La persona cuya propuesta ganó refina la representación
gráfica del logo con el nombre utilizando una herramienta
gráfica e incorporando las sugerencias de sus compañeros
acordadas por todos.</li>
</ul>
</div>
</li>

<li><a id="org7682590"></a>Técnica para repartir los roles<br />
<div class="outline-text-7" id="text-org7682590">
<ul class="org-ul">
<li>Hay cinco roles:

<ul class="org-ul">
<li>Desarrollador, que serán todos los miembros del equipo.</li>

<li>Responsable del equipo</li>

<li>Responsable técnico</li>

<li>Responsable de la calidad</li>

<li>Responsable de la colaboración</li>
</ul></li>

<li>Para repartir los roles se toman en cuenta las habilidades e
intereses de los miembros del equipo.</li>

<li>Reunión del equipo:

<ul class="org-ul">
<li>Cada alumno se presenta con su nombre, pasatiempos
favoritos y una pequeña descripción de su personalidad.</li>

<li>Luego, cada uno expone su lista de preferencias de roles y
argumenta las razones por las que le gustaría jugar su rol
preferente.</li>

<li>Cuando dos miembros del equipo quieran jugar un mismo rol,
tratar de convencer al equipo.</li>

<li>Si se mantiene el empate, se puede resolver con un volado.</li>
</ul></li>

<li>Si el equipo tiene 5 personas la comunicación y la
coordinación entre ellas se complica.</li>

<li>Se reparten en dos los roles de colaboración:

<ul class="org-ul">
<li>Uno se encarga del seguimiento del Tablero</li>

<li>Otro se encarga del manejo de repositorios y las versiones
de los documentos y código.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org5893a2d"></a>Técnica para proponer el nombre al producto de software<br />
<div class="outline-text-7" id="text-org5893a2d">
<ul class="org-ul">
<li>Todos los miembros del equipo deben leer el documento de
Planteamiento de Necesidades y comentarlo entre ellos. En
caso de dudas deben solicitar las aclaraciones al docente.</li>

<li>Una vez entendido el objetivo del software todos proponen el
nombre al sistema a desarrollar y lo seleccionan en votación.</li>
</ul>
</div>
</li>

<li><a id="org381cb25"></a>Técnica para generar la plantilla personalizada del Primer proyecto de software<br />
<div class="outline-text-7" id="text-org381cb25">
<ul class="org-ul">
<li>El responsable de la calidad personaliza e integra la
plantilla de la Portada de los documentos y la plantilla del
<i>Primer proyecto de software</i> colocando el logo y el nombre del
equipo. En todas las plantillas los textos marcados en azul
son los que tendrán que sustituirse por información generada
por el equipo.</li>

<li>El responsable de la calidad documenta los nombres de los
miembros del equpo con sus roles seleccionados y el nombre
del docente en la plantilla personalizada para el <i>Primer
proyecto de software</i>. En el mismo documento pone las
referencias al documento de <i>Planteamiento de Necesidades</i> y al
Guion del curso, así como las fechas de inicio y del fin del
proyecto indicadas en el guion.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org126913b" class="outline-4">
<h4 id="org126913b">Práctica Social 2. Definición de la comunicación en el equipo</h4>
<div class="outline-text-4" id="text-org126913b">
</div>
<ul class="org-ul">
<li><a id="orgfa61e84"></a>Objetivos<br />
<div class="outline-text-5" id="text-orgfa61e84">
<ul class="org-ul">
<li>Establecer las formas de comunicación síncrona del equipo para el proyecto.</li>
</ul>
</div>
</li>
