content/notas/IS/Notas.org
***** Productos de trabajo

      - Primer proyecto de software

	- Plantilla personalizada con los datos del equipo y proyecto.

**** Resultado
     
***** Condiciones

      - Equipo conformado
	
	- Con canales y formas de comunicación síncrona definidos.

***** Productos de trabajo

      - Primer proyecto de software
	
	- Plantilla personalizada con los datos del equipo, proyecto y
          comunicación.

***** Actividades

      1. Establecer reuniones diarias y completar la plantilla del
         /Primer proyecto de software/ con acuerdo de cómo se llevarán a
         cabo.
	 
      2. Establecer reuniones de toma de decisiones.

****** Técnica para establecer las reuniones diarias
       - El responsable del equipo es quien coordina la reunión
         diaria.
	 
       - La reunión dura 15 minutos. Cada miembro del equipo reporta
         los avancer contestando las siguientes preguntas:

	 - ¿Qué hiciste desde la última reunión?

	 - ¿Qué dificultades encontraste?

	 - ¿Qué harás antes de la siguiente reunión?

       - Al final de la reunión se acuerdan nuevos compromisos
         repartiendo el trabajo de manera equitativa y en consenso.

       - El equipo tiene que reunirse para acordar la fomra
         (presencial, virtual o mixta) y la hora de las reuniones
         diarias. En el caso de reuniones presenciales se define el
         lugar y en el caso de las virtuales se escoge el canal de
         comunicación.

       - La versión mixta significa que unos se juntan de manera
         presencial y otros se conectan virtualmente en la misma
         reunión. Se complementa la plantilla del /Primer proyecto de
         software/ con acuerdo de cómo se llevarán a cabo.

****** Técnica para establecer las reuniones de toma de decisiones
       Durante desarrollo de un proyecto se necesitan también
       reuniones del equipo para tratar asuntos en los cuales todos
       tienen que ponerse de acuerdo o tomar decisiones. Para este
       tipo de reuniones, se proponen los siguientes pasos:

       - CUalquier miembro del equipo envía invitaciones a la reunión
         a todos los miembros, estableciendo claramente día, hora,
         canal de reunión, si es virtual, o lugar, si es presencial.
       - Se definen los objetivos de la reunión.
       - Se establece si hay trabajo previo que deberá hacer cada
         miembro del equipo antes de llegar a la reunión.
       - Todos los miembros del equipo llegan a la reunión con el
         trabajo solicitado.
       - Se inicia el trabajo y se abre a la discusión para lograr los
         objetivos y se llegan a acuerdos.
       - El responsable de la colaboración registra los puntos y los
         acuerdos, resguardándolos en el repositorio común para que
         todos puedan consultarlos.

****** Repositorio común de documentos
       - Durante el desarrollo de software se feneran diversos
         documentos que plasman el trabajo.

	 Todos estos documentos deben estar accesibles a los miembros
         del equipo y demás interesados. Por esto se guardan en un
         repositorio común de documentos asignado para cada proyecto.

       - El repositorio ayuda a establecer una comunicación asíncrona
         del equipo porque permite a todos los miembros consultar en
         cualquier momento los documentos y acuerdos generados, lo que
         ayuda a tener una visibilidad del avance del trabajo.

       - Google Drive o Dropbox son ejemplos de las herramientas que
         sirven para crear los repositorios de documentos.

*** Práctica Social 3. Creación del repositorio común de documentos

**** Objetivos

     Tener un repositorio común de documentos del equipo para
     facilitar la colaboración.

**** Entrada
     
***** Condiciones

      - Equipo conformado
	
	- Con canales y formas de comunicación síncrona definidos.

***** Productos de trabajo

      - Primer proyecto de software

	- Plantilla personalidzada con los datos del equipo, proyecto
          y comunicación.

**** Resultado

***** Condiciones

      - Equipo conformado

	- Con canales y formas de comunicación síncrona definidos.

	- Con repositorio com+un de documentos.

***** Productos de trabajo

      - Primer proyecto de software
	
	- Plantilla personalizada con los datos del equipo, proyecto,
          comunicación y repositorio.

***** Actividades

      1. Seleccionar el repositorio común de documentos
      2. Crear el repositorio común de documentos y registrarlo en la plantilla del /Primer proyecto de software/.

****** Técnica para seleccionar el repositorio común de documentos
       El equipo puede seguir estos pasos para seleccionar la
       herramienta para el repositorio común de documentos:

       - El responsable de la colaboración busca en Internet las
         herramientas gratuitas para repositorios de documentos.

       - En una reunión con el equipo el Responsable de la
         colaboración presenta las ventajas y desventajas de las
         herramientas.

       - El equipo selecciona de común acuerdo una de las herramientas
         que les convenga más.

       - El responsable de la colaboración crea el repositorio común
         en una carpeta y propone una estructura de carpetas inicial.

       - Da los permisos de acceso a todos los demás miembros del
         equipo incluyendo al docente.

       - Capacita a los demás miembros del equipo en el uso de la
         herramienta, si sea necesario.

       - El responsable de la calidad introduce el nombre de la
         carpeta que contendrá al repositorio, en la plantilla del
         /Primer proyecto de software/, incluyendo la liga al mismo y
         guarda la plantilla completa en el repositorio.

** Unidad 4
*** Concepto de Proyecto

    Un proyecto se puede definir como el esfuerzo de una organización
    para desarrollar, introudico o evaluar un resultado único.

    Es un esfuerzo que se lleva a cabo durante un periodo de tiempo
    delimitado, con un equipo de trabajo asignado y con recursos
    disponibles para producirlo.
    
*** Administración de Proyecto

    La "Administracion de proyectos es la aplicación de conocimientos,
    habilidades, herraminetas y técnicas a las actividades de un
    rpoyecto para satisfacer su requisitos." (PMBOK, 2013)

    Los requisitos principales de un proyecto son: calida, tiempo y
    costo.

    Tiene por objetivo establecer y lleavar a cabo sistemáticamente un
    conjunto de actividades a fin de lograr el objetivo del proyecto
    de software en calidad, tiempo y costo. (ISO/IEC 29110)

**** Entrada

     El planteamiento de necesidades

**** Salida

     El Plan del proyecto

