notas/IS/Notas.html

<li><a id="org2e380c5"></a>Entrada<br />
<ul class="org-ul">
<li><a id="org39feeea"></a>Condiciones<br />
<div class="outline-text-6" id="text-org39feeea">
<ul class="org-ul">
<li>Equipo conformado</li>
</ul>
</div>
</li>

<li><a id="org314496b"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-org314496b">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Plantilla personalizada con los datos del equipo y proyecto.</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org14aff48"></a>Resultado<br />
<ul class="org-ul">
<li><a id="orga33881a"></a>Condiciones<br />
<div class="outline-text-6" id="text-orga33881a">
<ul class="org-ul">
<li>Equipo conformado

<ul class="org-ul">
<li>Con canales y formas de comunicación síncrona definidos.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org5033781"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-org5033781">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Plantilla personalizada con los datos del equipo, proyecto y
comunicación.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org8c73d72"></a>Actividades<br />
<div class="outline-text-6" id="text-org8c73d72">
<ol class="org-ol">
<li>Establecer reuniones diarias y completar la plantilla del
<i>Primer proyecto de software</i> con acuerdo de cómo se llevarán a
cabo.</li>

<li>Establecer reuniones de toma de decisiones.</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="org95b6742"></a>Técnica para establecer las reuniones diarias<br />
<div class="outline-text-7" id="text-org95b6742">
<ul class="org-ul">
<li>El responsable del equipo es quien coordina la reunión
diaria.</li>

<li>La reunión dura 15 minutos. Cada miembro del equipo reporta
los avancer contestando las siguientes preguntas:

<ul class="org-ul">
<li>¿Qué hiciste desde la última reunión?</li>

<li>¿Qué dificultades encontraste?</li>

<li>¿Qué harás antes de la siguiente reunión?</li>
</ul></li>

<li>Al final de la reunión se acuerdan nuevos compromisos
repartiendo el trabajo de manera equitativa y en consenso.</li>

<li>El equipo tiene que reunirse para acordar la fomra
(presencial, virtual o mixta) y la hora de las reuniones
diarias. En el caso de reuniones presenciales se define el
lugar y en el caso de las virtuales se escoge el canal de
comunicación.</li>

<li>La versión mixta significa que unos se juntan de manera
presencial y otros se conectan virtualmente en la misma
reunión. Se complementa la plantilla del <i>Primer proyecto de
software</i> con acuerdo de cómo se llevarán a cabo.</li>
</ul>
</div>
</li>

<li><a id="org4e794d3"></a>Técnica para establecer las reuniones de toma de decisiones<br />
<div class="outline-text-7" id="text-org4e794d3">
<p>
Durante desarrollo de un proyecto se necesitan también
reuniones del equipo para tratar asuntos en los cuales todos
tienen que ponerse de acuerdo o tomar decisiones. Para este
tipo de reuniones, se proponen los siguientes pasos:
</p>

<ul class="org-ul">
<li>CUalquier miembro del equipo envía invitaciones a la reunión
a todos los miembros, estableciendo claramente día, hora,
canal de reunión, si es virtual, o lugar, si es presencial.</li>
<li>Se definen los objetivos de la reunión.</li>
<li>Se establece si hay trabajo previo que deberá hacer cada
miembro del equipo antes de llegar a la reunión.</li>
<li>Todos los miembros del equipo llegan a la reunión con el
trabajo solicitado.</li>
<li>Se inicia el trabajo y se abre a la discusión para lograr los
objetivos y se llegan a acuerdos.</li>
<li>El responsable de la colaboración registra los puntos y los
acuerdos, resguardándolos en el repositorio común para que
todos puedan consultarlos.</li>
</ul>
</div>
</li>

<li><a id="org62e2583"></a>Repositorio común de documentos<br />
<div class="outline-text-7" id="text-org62e2583">
<ul class="org-ul">
<li><p>
Durante el desarrollo de software se feneran diversos
documentos que plasman el trabajo.
</p>

<p>
Todos estos documentos deben estar accesibles a los miembros
del equipo y demás interesados. Por esto se guardan en un
repositorio común de documentos asignado para cada proyecto.
</p></li>

<li>El repositorio ayuda a establecer una comunicación asíncrona
del equipo porque permite a todos los miembros consultar en
cualquier momento los documentos y acuerdos generados, lo que
ayuda a tener una visibilidad del avance del trabajo.</li>

<li>Google Drive o Dropbox son ejemplos de las herramientas que
sirven para crear los repositorios de documentos.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgf7fffff" class="outline-4">
<h4 id="orgf7fffff">Práctica Social 3. Creación del repositorio común de documentos</h4>
<div class="outline-text-4" id="text-orgf7fffff">
</div>
<ul class="org-ul">
<li><a id="orgc5b6585"></a>Objetivos<br />
<div class="outline-text-5" id="text-orgc5b6585">
<p>
Tener un repositorio común de documentos del equipo para
facilitar la colaboración.
</p>
</div>
</li>

<li><a id="orga82eeda"></a>Entrada<br />
<ul class="org-ul">
<li><a id="org100c682"></a>Condiciones<br />
<div class="outline-text-6" id="text-org100c682">
<ul class="org-ul">
<li>Equipo conformado

<ul class="org-ul">
<li>Con canales y formas de comunicación síncrona definidos.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org19d399c"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-org19d399c">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Plantilla personalidzada con los datos del equipo, proyecto
y comunicación.</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org38d4a3d"></a>Resultado<br />
<ul class="org-ul">
<li><a id="org4fb9f2c"></a>Condiciones<br />
<div class="outline-text-6" id="text-org4fb9f2c">
<ul class="org-ul">
<li>Equipo conformado

<ul class="org-ul">
<li>Con canales y formas de comunicación síncrona definidos.</li>

<li>Con repositorio com+un de documentos.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgb364044"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-orgb364044">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Plantilla personalizada con los datos del equipo, proyecto,
comunicación y repositorio.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org7b66ef6"></a>Actividades<br />
<div class="outline-text-6" id="text-org7b66ef6">
<ol class="org-ol">
<li>Seleccionar el repositorio común de documentos</li>
<li>Crear el repositorio común de documentos y registrarlo en la plantilla del <i>Primer proyecto de software</i>.</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="orgbbe7468"></a>Técnica para seleccionar el repositorio común de documentos<br />
<div class="outline-text-7" id="text-orgbbe7468">
<p>
El equipo puede seguir estos pasos para seleccionar la
herramienta para el repositorio común de documentos:
</p>

<ul class="org-ul">
<li>El responsable de la colaboración busca en Internet las
herramientas gratuitas para repositorios de documentos.</li>

<li>En una reunión con el equipo el Responsable de la
colaboración presenta las ventajas y desventajas de las
herramientas.</li>

<li>El equipo selecciona de común acuerdo una de las herramientas
que les convenga más.</li>

<li>El responsable de la colaboración crea el repositorio común
en una carpeta y propone una estructura de carpetas inicial.</li>

<li>Da los permisos de acceso a todos los demás miembros del
equipo incluyendo al docente.</li>

<li>Capacita a los demás miembros del equipo en el uso de la
herramienta, si sea necesario.</li>

<li>El responsable de la calidad introduce el nombre de la
carpeta que contendrá al repositorio, en la plantilla del
<i>Primer proyecto de software</i>, incluyendo la liga al mismo y
guarda la plantilla completa en el repositorio.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb67cabb" class="outline-3">
<h3 id="orgb67cabb">Unidad 4</h3>
<div class="outline-text-3" id="text-orgb67cabb">
</div>
<div id="outline-container-orgf72a853" class="outline-4">
<h4 id="orgf72a853">Concepto de Proyecto</h4>
<div class="outline-text-4" id="text-orgf72a853">
<p>
Un proyecto se puede definir como el esfuerzo de una organización
para desarrollar, introudico o evaluar un resultado único.
</p>

<p>
Es un esfuerzo que se lleva a cabo durante un periodo de tiempo
delimitado, con un equipo de trabajo asignado y con recursos
disponibles para producirlo.
</p>
</div>
</div>

<div id="outline-container-org1598646" class="outline-4">
<h4 id="org1598646">Administración de Proyecto</h4>
<div class="outline-text-4" id="text-org1598646">
<p>
La "Administracion de proyectos es la aplicación de conocimientos,
habilidades, herraminetas y técnicas a las actividades de un
rpoyecto para satisfacer su requisitos." (PMBOK, 2013)
</p>

<p>
Los requisitos principales de un proyecto son: calida, tiempo y
costo.
</p>

<p>
Tiene por objetivo establecer y lleavar a cabo sistemáticamente un
conjunto de actividades a fin de lograr el objetivo del proyecto
de software en calidad, tiempo y costo. (ISO/IEC 29110)
</p>
</div>

<ul class="org-ul">
