content/notas/IS/Notas.org
**** Actividades principales

     - Planificar el proyecto
       
     - Ejecutar el Plan del proyecto

     - Evaluar y controlar el proyecto

     - Cerrar el proyecto

*** Planificar el proyecto

    - La planificación del proyecto se inicia con el entendimiento de
      sus objetivos y restricciones.
      
    - Se definen qué actividades se deben llevar a cabo en un
      proyecto, quién las debe hacer y cuándo.
      
    - El resultado de la actividad de planificar el proyecto es el
      documento llamado Plan de proyecto.

    - Los objetivos del proyecto acordes con las necesidades del cliente.

    - Las fechas de inicio y fin del proyecto

    - La lista de los entregables, que son los documentos que serán
      entregados al cliente, junto con el código del producto de
      software.

    - La fecha y forma de cómo se entregará el producto de software
      acordadas con el cliente.

    - La identificación de las funcionalidades que tendrá el sistema o
      producto de software.

    - Restricciones no funcionales (por ejemplo: uso de cierto
      lenguaje de programación o base de datos, entre otros).

*** Diagrama general de casos de uso

    - Una de las técnicas para identificar las funcionalidades de un
      producto de software, se llama casos de uso.

    - Es una vista gráfica más general y abstracta del sistema de
      software.

    - Representa las funcionalidades generales del software.

    - Define qué tipo de usuarios utilizarán el software.

    - El diagrama es un conjunto de casos de uso.

    - Ésta técnica se utiliza para comprender las necesidades o los
      requerimientos funcionales y a partir de ellos se diseña,
      implementa y prueba el software.

    - La importancia del Diagrama general de casos de uso reside en
      que las prácticas de desarrollo se pueden guiar por los casos de
      uso. (Rosenberg Doug, 2001).

*** Práctica Administrativa 1. Planificar el proyecto

**** Objetivos

     Generar el Plan del proyecto

**** Entrada

***** Condiciones

      Equipo de trabajo conformado

***** Productos de trabajo

      - Primer proyecto de software

	- Planteamiento de necesidades

	- Guion del curso

**** Resultado

***** Condiciones

      Proyecto planificado

***** Productos de trabajo

      - Plan del proyecto

	- Nombre del proyecto

	- Objetivo del proyecto

	- Fecha de inicio y fin

	- Entregables

	- Fecha y forma de entrega del producto de software

	- Identificación de las funcionalidades del producto de software

**** Actividades

     1. Identificar las funcionalidades del producto.
     2. Hacer el Plan del proyecto

**** Elementos del Plan del Proyecto

     - Los puntos que incluye el Plan del Primer Proyecto de Software:

       - Objetivo del proyecto: basado en Planteamiento de necesidades

       - Fechas: las fechas de inicio y fin del proyecto definidas en
         el Guión del Curso.

       - Entregables: Descripción de lo que se entregará al final del
         proyecto, estos son los documentos resultantes de cada
         práctica del desarrollo y el código de software. (ver nombres
         de las plantillas y el Guión del Curso).

     - Fechas y forma de entregar el producto

     - Diagrama general de casos de uso

***** Técnica para Identificar las funcionalidades del producto

      - Uno de los elementos para hacer el Plan de proyecto es la
        identificación de las funcionalidades del producto de
        software.
	
      - Esta tarea la vamos a hacer construyendo el Diagrama general
        de casos de uso.

****** Pasos para identificar a los actores y los casos de uso:
       - Identificar los actores del sistema. Para identificar a un
         actor se revisa el PLanteamiento de necesidades a fin de
         identificar qué tipo de usuarios interactúan con el software.

       - Identificar los casos de uso para cada actor. Para cada actor
         que ya identificaste, buscas en el Planteamiento de
         necesidades, qué es lo que podrá hacer ese actor con el
         sistema.

******* Dibujar el Diagrama general de casos de uso

	- Para cada actor identificado, dibujar el actor con la
          herramienta.

	- Para cada caso de uso identificado, dibujar un óvalo en el
          diagrama y asignarle nombre que inicia con un verbo en
          infinitivo, tal como fue identificado el el Planteamiento
          del problema.

	- Para cada actor dibujar una línea recta entre el actor y los
          casos de uso que puede ejecutar. Un actor puede ejecutar
          muchos casos de uso y un caso de uso puede ser efectuado por
          muchos actores.

	- Todos los casos de uso identificados se enmarcan en un
          rectángulo para delimitar el alcance del sistema.

**** Planificar la iteración

     - Los métodos ágiles de desarrollo de software proponen que el
       desarrollo sea iterativo.

     - El desarrollo se divide en varias iteraciones de tiempos
       cortos.

     - En cada iteración se realizan las actividades que permiten
       entregar un producto con funcionalidades parciales, que el
       cliente puede probar.

     - El producto va incrementando sus funcionalidades con las
       entregas en cada iteración, hasta satisfacer completamente las
       necesidades del cliente.

***** Definición del alcance de cada iteración

      - Se escogen qué funcionalidades se implementarán en esa
        iteración.

      - Criterios de selección de casos de uso para una iteración.

	- Seleccionar los que son prioritarios para el cliente.

	- Seleccionar los que no dependen de los que no se
          seleccionaron.

	- Seleccionar por lo menos un caso de uso por integrante del
          equipo.

      - La duración de cada iteración depende del contexto de cada
        proyecto y las prioridades del cliente.

***** Tablero

      - Para ayuda al equipo a tener visibilidad de lo que hay que
        hacer en cada iteración y permitir que se le dé seguimiento,
        usaremos un Tablero.

      - Este tablero es una versión simplificada de una técnica ágil
        llamada Kanban (Anderson, 2010).

      - El objetivo del Tablero es permitir la visibilidad del avance
        en las actividades de desarrollo de todos los miembros del
        equipo y poder saber quién está trabajando en cada parte del
        proyecto.

*** Pŕactica Administrativa 2. Planificar la iteración

**** Objetivos

     Planificar el alcance y preparar la iteración

**** Entrada

***** Condiciones

      Se iniciará una iteración

***** Productos de trabajo

      - Primer proyecto de software
	- Repositorio compartido
      - Plan del proyecto

