notas/IS/Notas.html
<li><a id="org983de3d"></a>Entrada<br />
<div class="outline-text-5" id="text-org983de3d">
<p>
El planteamiento de necesidades
</p>
</div>
</li>

<li><a id="orga4696eb"></a>Salida<br />
<div class="outline-text-5" id="text-orga4696eb">
<p>
El Plan del proyecto
</p>
</div>
</li>

<li><a id="org67c6ae1"></a>Actividades principales<br />
<div class="outline-text-5" id="text-org67c6ae1">
<ul class="org-ul">
<li>Planificar el proyecto</li>

<li>Ejecutar el Plan del proyecto</li>

<li>Evaluar y controlar el proyecto</li>

<li>Cerrar el proyecto</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org957b71c" class="outline-4">
<h4 id="org957b71c">Planificar el proyecto</h4>
<div class="outline-text-4" id="text-org957b71c">
<ul class="org-ul">
<li>La planificación del proyecto se inicia con el entendimiento de
sus objetivos y restricciones.</li>

<li>Se definen qué actividades se deben llevar a cabo en un
proyecto, quién las debe hacer y cuándo.</li>

<li>El resultado de la actividad de planificar el proyecto es el
documento llamado Plan de proyecto.</li>

<li>Los objetivos del proyecto acordes con las necesidades del cliente.</li>

<li>Las fechas de inicio y fin del proyecto</li>

<li>La lista de los entregables, que son los documentos que serán
entregados al cliente, junto con el código del producto de
software.</li>

<li>La fecha y forma de cómo se entregará el producto de software
acordadas con el cliente.</li>

<li>La identificación de las funcionalidades que tendrá el sistema o
producto de software.</li>

<li>Restricciones no funcionales (por ejemplo: uso de cierto
lenguaje de programación o base de datos, entre otros).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0b2f78" class="outline-4">
<h4 id="orgb0b2f78">Diagrama general de casos de uso</h4>
<div class="outline-text-4" id="text-orgb0b2f78">
<ul class="org-ul">
<li>Una de las técnicas para identificar las funcionalidades de un
producto de software, se llama casos de uso.</li>

<li>Es una vista gráfica más general y abstracta del sistema de
software.</li>

<li>Representa las funcionalidades generales del software.</li>

<li>Define qué tipo de usuarios utilizarán el software.</li>

<li>El diagrama es un conjunto de casos de uso.</li>

<li>Ésta técnica se utiliza para comprender las necesidades o los
requerimientos funcionales y a partir de ellos se diseña,
implementa y prueba el software.</li>

<li>La importancia del Diagrama general de casos de uso reside en
que las prácticas de desarrollo se pueden guiar por los casos de
uso. (Rosenberg Doug, 2001).</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd6768f" class="outline-4">
<h4 id="orgcd6768f">Práctica Administrativa 1. Planificar el proyecto</h4>
<div class="outline-text-4" id="text-orgcd6768f">
</div>
<ul class="org-ul">
<li><a id="org886736e"></a>Objetivos<br />
<div class="outline-text-5" id="text-org886736e">
<p>
Generar el Plan del proyecto
</p>
</div>
</li>

<li><a id="org209feb8"></a>Entrada<br />
<ul class="org-ul">
<li><a id="org5b32881"></a>Condiciones<br />
<div class="outline-text-6" id="text-org5b32881">
<p>
Equipo de trabajo conformado
</p>
</div>
</li>

<li><a id="orgbae1cd4"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-orgbae1cd4">
<ul class="org-ul">
<li>Primer proyecto de software

<ul class="org-ul">
<li>Planteamiento de necesidades</li>

<li>Guion del curso</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org5dc25c9"></a>Resultado<br />
<ul class="org-ul">
<li><a id="org1cf1846"></a>Condiciones<br />
<div class="outline-text-6" id="text-org1cf1846">
<p>
Proyecto planificado
</p>
</div>
</li>

<li><a id="org07e315a"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-org07e315a">
<ul class="org-ul">
<li>Plan del proyecto

<ul class="org-ul">
<li>Nombre del proyecto</li>

<li>Objetivo del proyecto</li>

<li>Fecha de inicio y fin</li>

<li>Entregables</li>

<li>Fecha y forma de entrega del producto de software</li>

<li>Identificación de las funcionalidades del producto de software</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="orgfe3d0a6"></a>Actividades<br />
<div class="outline-text-5" id="text-orgfe3d0a6">
<ol class="org-ol">
<li>Identificar las funcionalidades del producto.</li>
<li>Hacer el Plan del proyecto</li>
</ol>
</div>
</li>

<li><a id="orgd1d288e"></a>Elementos del Plan del Proyecto<br />
<div class="outline-text-5" id="text-orgd1d288e">
<ul class="org-ul">
<li>Los puntos que incluye el Plan del Primer Proyecto de Software:

<ul class="org-ul">
<li>Objetivo del proyecto: basado en Planteamiento de necesidades</li>

<li>Fechas: las fechas de inicio y fin del proyecto definidas en
el Guión del Curso.</li>

<li>Entregables: Descripción de lo que se entregará al final del
proyecto, estos son los documentos resultantes de cada
práctica del desarrollo y el código de software. (ver nombres
de las plantillas y el Guión del Curso).</li>
</ul></li>

<li>Fechas y forma de entregar el producto</li>

<li>Diagrama general de casos de uso</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org4487752"></a>Técnica para Identificar las funcionalidades del producto<br />
<div class="outline-text-6" id="text-org4487752">
<ul class="org-ul">
<li>Uno de los elementos para hacer el Plan de proyecto es la
identificación de las funcionalidades del producto de
software.</li>

<li>Esta tarea la vamos a hacer construyendo el Diagrama general
de casos de uso.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org727c384"></a>Pasos para identificar a los actores y los casos de uso:<br />
<div class="outline-text-7" id="text-org727c384">
<ul class="org-ul">
<li>Identificar los actores del sistema. Para identificar a un
actor se revisa el PLanteamiento de necesidades a fin de
identificar qué tipo de usuarios interactúan con el software.</li>

<li>Identificar los casos de uso para cada actor. Para cada actor
que ya identificaste, buscas en el Planteamiento de
necesidades, qué es lo que podrá hacer ese actor con el
sistema.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgeee4849"></a>Dibujar el Diagrama general de casos de uso<br />
<div class="outline-text-8" id="text-orgeee4849">
<ul class="org-ul">
<li>Para cada actor identificado, dibujar el actor con la
herramienta.</li>

<li>Para cada caso de uso identificado, dibujar un óvalo en el
diagrama y asignarle nombre que inicia con un verbo en
infinitivo, tal como fue identificado el el Planteamiento
del problema.</li>

<li>Para cada actor dibujar una línea recta entre el actor y los
casos de uso que puede ejecutar. Un actor puede ejecutar
muchos casos de uso y un caso de uso puede ser efectuado por
muchos actores.</li>

<li>Todos los casos de uso identificados se enmarcan en un
rectángulo para delimitar el alcance del sistema.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li><a id="org4235015"></a>Planificar la iteración<br />
<div class="outline-text-5" id="text-org4235015">
<ul class="org-ul">
<li>Los métodos ágiles de desarrollo de software proponen que el
desarrollo sea iterativo.</li>

<li>El desarrollo se divide en varias iteraciones de tiempos
cortos.</li>

<li>En cada iteración se realizan las actividades que permiten
entregar un producto con funcionalidades parciales, que el
cliente puede probar.</li>

<li>El producto va incrementando sus funcionalidades con las
entregas en cada iteración, hasta satisfacer completamente las
necesidades del cliente.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org158cc4d"></a>Definición del alcance de cada iteración<br />
<div class="outline-text-6" id="text-org158cc4d">
<ul class="org-ul">
<li>Se escogen qué funcionalidades se implementarán en esa
iteración.</li>

<li>Criterios de selección de casos de uso para una iteración.

<ul class="org-ul">
<li>Seleccionar los que son prioritarios para el cliente.</li>

<li>Seleccionar los que no dependen de los que no se
seleccionaron.</li>

<li>Seleccionar por lo menos un caso de uso por integrante del
equipo.</li>
</ul></li>

<li>La duración de cada iteración depende del contexto de cada
proyecto y las prioridades del cliente.</li>
</ul>
</div>
</li>

<li><a id="orga5fcb38"></a>Tablero<br />
<div class="outline-text-6" id="text-orga5fcb38">
<ul class="org-ul">
<li>Para ayuda al equipo a tener visibilidad de lo que hay que
hacer en cada iteración y permitir que se le dé seguimiento,
usaremos un Tablero.</li>

<li>Este tablero es una versión simplificada de una técnica ágil
llamada Kanban (Anderson, 2010).</li>

<li>El objetivo del Tablero es permitir la visibilidad del avance
en las actividades de desarrollo de todos los miembros del
equipo y poder saber quién está trabajando en cada parte del
proyecto.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orge187c4c" class="outline-4">
<h4 id="orge187c4c">Pŕactica Administrativa 2. Planificar la iteración</h4>
<div class="outline-text-4" id="text-orge187c4c">
</div>
<ul class="org-ul">
<li><a id="orgecbdb9b"></a>Objetivos<br />
<div class="outline-text-5" id="text-orgecbdb9b">
<p>
Planificar el alcance y preparar la iteración
</p>
</div>
</li>

<li><a id="orge9ff3b5"></a>Entrada<br />
<ul class="org-ul">
<li><a id="org100bba9"></a>Condiciones<br />
<div class="outline-text-6" id="text-org100bba9">
<p>
Se iniciará una iteración
</p>
</div>
</li>
