content/notas/IS/Notas.org
**** Resultado

***** Productos de trabajo

      - Tablero de la iteración creado para el alcance de iteración.

      - Repositorio compartido incluyendo una carpeta para la
        iteración.

**** Actividades

     1. Construir el Tablero de la iteración

     2. Definir el alcance de la iteración

     3. Crear la carpeta de la iteración en el repositorio común para
        el resguardo de documentos de la iteración.

***** Técnica para construir el Tablero de la iteración

      - Para crear el Tablero para cada iteración existen herramientas
        en web que ayudan a automatizarlo.

      - Se recomienda hacer un búsqueda de este tipo de herramientas
        para crear tableros Kanban que sea gratuitos y que se podrán
        configurar según las necesidades del curso.
****** Contrucción del Tablero
       - Los pasos para crear el Tablero son:

	 - Si es la primera iteración, el Responsable de la
           colaboración, en conjunto con el equipo selecciona la
           herramienta para construir el Tablero y asegura que todos
           se capacitan en su uso.

	 - El responsable de la colaboración contruye el Tablero para
           el equipo.

	 - El Responsable de la colaboración pone en el tablero, en la
           columna por hacer una tarjeta.
	   
***** Iteraciones en el Plan del Proyecto

      - El primer proyecto se va a desarrollar en dos iteraciones:

	- Primera iteración, se construirá el producto de software
          para una seleccción de funcionalidades prioritarias.

	- Segunda iteración, se incluirán funcionalidades restante y
          se refinarán las funcionalidades ya implementadas.

	- Para definir el alcance de cada iteración se debe generar el
          diagrama general de casos de uso.

***** Técnica para definir el alcance de la iteración

      - Al inicio de cada iteración se define su alcance como un
        sobconjunto de casos de uso del Diagrama general de casos de
        uso, por lo que se hace un diagrama específico para esa
        iteración.

      - Para establecer cuáles casos de uso se incluirán en la
        iteración se deben aplicar los criterios:

	- Casos de usos que son prioritarios para el cliente

	- Casos de uso independientes de otros

	- Casos de uso que dependen de los que ya están implementados

	- Cada miembro del equipo sea responsable de por lo menos un
          caso de uso.

      - El responsable técnico convoca una reunión del equipo
        siguiendo la técnica TS6 con el objetivo de escoger los casos
        de uso para el alcance de la iteración ejecutando la técnica
        TA4.

      - Cada Desarrollador coloca en el Tablero, en la columna de Por
        hacer, una tarjeta azul por cada caso de uso en el alcance de
        la iteración del cual es responsable con fecha de terminación,
        el fin de la iteración.

***** Técnica para crear la carpeta de la iteración en el repositorio común para el resguardo de documentos de la iteración

      - Al inicio de cada iteración se coloca una carpeta nueva en el
        repositorio compartido, con el identificador de la iteración.

      - Esta carpeta servira para resguardar todos los documentos
        generados durante la iteración.

      - Si se trata de la primera iteración, se colocan en esa
        carpeta, las plantillas para todos los entregables.

      - El Responsable de la calidad es el encargado de personalizar y
        asegurarse que estén correctos los productos.

      - El Responsable de la colaboración se encarga de llevar el
        control de las versiones de los documentos y que estén
        resguardados en el repositorio en la carpeta correspondiente.

      - El Responsable de la colaboración coloca la tarjeta de Crear
        la carpeta de la iteración en el Tablero en la columna POr
        hacer, moviendo esa tarjeta según avanza en la realización de
        esa actividad.

      - El Responsable de la calidad coloca la tarjeta Inicializar los
        documentos en la carpeta de la nueva iteración en la columna
        Por hacer del Tablero, moviendo esa tarjeta según avanza en la
        realización de esa actividad.

***** Ejecutar el Plan del proyecto

      - Dentro de la Administración de proyectos, la actividad de
        Ejecutar el proyecto tiene como objetivo asegurarse que se
        lleve a cabo el plan en tiempo y forma.

      - Hay que darle seguimiento a las actividades que están
        realizando los miembros del equipo.

      - Para saber si el plan se cumple, hay que dar el seguimiento a
        su ejecución:

	- Evidencia de las reuniones del equipo de trabajo

	- Registro del estado del progreso actualizado

	- Repositorio del proyecto actualizado y respaldado

	- Solicitudes de cambios que se analizan y evalúan revisando
          los impactos a los costos, calendario y requerimientos
          técnicos que se necesitan. Si se aprueban, se documentan.

	- Cuando se está trabajando de forma iterativa, en la
          ejecución se tiene el subconjunto de las actividades a
          realizar en el proyecto, restringido al alcance de la
          iteración.

*** Práctica Administrativa 3. Ejecutar el plan de la iteración

**** Objetivos

     Asegurarse que el /Plan del proyecto/ se lleve a cabo en tiempo y
     forma según lo planeado para la iteración.

**** Entrada

     Condiciones: Iteración en ejecución

     Productos de trabajo: /Tablero/ de la iteración.

**** Resultado

     Condiciones: Iteración en ejecución.

     Productos de trabajo: /Tablero/ actualizado.

**** Actividades

     Ejecutar lo planeado para la iteración revisando y actualizando el /Tablero/ (TA6)

**** Herramientas

     Herramienta para el Tablero

***** Plan de iteración

      En la reunión diaria del equipo, en 15 minutos, todos contestan
      3 preguntas y actualizan el estado del tablero de seguimiento
      según sus avences.

      Las preguntas son:

      - ¿Qué hice desde la última reunión?
      - ¿Qué haré?
      - ¿Qué dificultades encontré?


      Con base a las respuestas, el responsable de la colaboración actualiza el tablero moviendo las tarjetas a /Hecho/ o generando nuevas.

***** Técnica para ejecutar lo planeado para la iteración revisando y actualizando el /Tablero/

      En las reuniones diarias del equipo, cada miembro muestra su
      avance reflejado en el estado de sus tarjetas en las columnas
      del /Tablero/.

      Según su rol, de agregan nuevas tarjetas al /Tablero/ de acuerdo
      con sus responsabilidades.

      El Responsable de la colaboración se asegura que todos
      actualicen el /Tablero/ moviendo sus tarjetas según el estado del
      trabajo de cada día.

      De esta manera todos sabrán en qué están trabajando los demás,
      podrán establecer comunicación con quién tenga trabajo
      relacionado, o del que dependa su actividad.

      Todos pueden ver el avance de sus compañeros, notar si hay
      retrasos y tratar de resolverlos.

