notas/IS/Notas.html

<li><a id="org7d9cff9"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-org7d9cff9">
<ul class="org-ul">
<li>Primer proyecto de software
<ul class="org-ul">
<li>Repositorio compartido</li>
</ul></li>
<li>Plan del proyecto</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="org094f4f6"></a>Resultado<br />
<ul class="org-ul">
<li><a id="orged40ad1"></a>Productos de trabajo<br />
<div class="outline-text-6" id="text-orged40ad1">
<ul class="org-ul">
<li>Tablero de la iteración creado para el alcance de iteración.</li>

<li>Repositorio compartido incluyendo una carpeta para la
iteración.</li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="orgd58a892"></a>Actividades<br />
<div class="outline-text-5" id="text-orgd58a892">
<ol class="org-ol">
<li>Construir el Tablero de la iteración</li>

<li>Definir el alcance de la iteración</li>

<li>Crear la carpeta de la iteración en el repositorio común para
el resguardo de documentos de la iteración.</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="org801996c"></a>Técnica para construir el Tablero de la iteración<br />
<div class="outline-text-6" id="text-org801996c">
<ul class="org-ul">
<li>Para crear el Tablero para cada iteración existen herramientas
en web que ayudan a automatizarlo.</li>

<li>Se recomienda hacer un búsqueda de este tipo de herramientas
para crear tableros Kanban que sea gratuitos y que se podrán
configurar según las necesidades del curso.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgfabe757"></a>Contrucción del Tablero<br />
<div class="outline-text-7" id="text-orgfabe757">
<ul class="org-ul">
<li>Los pasos para crear el Tablero son:

<ul class="org-ul">
<li>Si es la primera iteración, el Responsable de la
colaboración, en conjunto con el equipo selecciona la
herramienta para construir el Tablero y asegura que todos
se capacitan en su uso.</li>

<li>El responsable de la colaboración contruye el Tablero para
el equipo.</li>

<li>El Responsable de la colaboración pone en el tablero, en la
columna por hacer una tarjeta.</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>

<li><a id="orge3b2f6a"></a>Iteraciones en el Plan del Proyecto<br />
<div class="outline-text-6" id="text-orge3b2f6a">
<ul class="org-ul">
<li>El primer proyecto se va a desarrollar en dos iteraciones:

<ul class="org-ul">
<li>Primera iteración, se construirá el producto de software
para una seleccción de funcionalidades prioritarias.</li>

<li>Segunda iteración, se incluirán funcionalidades restante y
se refinarán las funcionalidades ya implementadas.</li>

<li>Para definir el alcance de cada iteración se debe generar el
diagrama general de casos de uso.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org97169f6"></a>Técnica para definir el alcance de la iteración<br />
<div class="outline-text-6" id="text-org97169f6">
<ul class="org-ul">
<li>Al inicio de cada iteración se define su alcance como un
sobconjunto de casos de uso del Diagrama general de casos de
uso, por lo que se hace un diagrama específico para esa
iteración.</li>

<li>Para establecer cuáles casos de uso se incluirán en la
iteración se deben aplicar los criterios:

<ul class="org-ul">
<li>Casos de usos que son prioritarios para el cliente</li>

<li>Casos de uso independientes de otros</li>

<li>Casos de uso que dependen de los que ya están implementados</li>

<li>Cada miembro del equipo sea responsable de por lo menos un
caso de uso.</li>
</ul></li>

<li>El responsable técnico convoca una reunión del equipo
siguiendo la técnica TS6 con el objetivo de escoger los casos
de uso para el alcance de la iteración ejecutando la técnica
TA4.</li>

<li>Cada Desarrollador coloca en el Tablero, en la columna de Por
hacer, una tarjeta azul por cada caso de uso en el alcance de
la iteración del cual es responsable con fecha de terminación,
el fin de la iteración.</li>
</ul>
</div>
</li>

<li><a id="org19076b5"></a>Técnica para crear la carpeta de la iteración en el repositorio común para el resguardo de documentos de la iteración<br />
<div class="outline-text-6" id="text-org19076b5">
<ul class="org-ul">
<li>Al inicio de cada iteración se coloca una carpeta nueva en el
repositorio compartido, con el identificador de la iteración.</li>

<li>Esta carpeta servira para resguardar todos los documentos
generados durante la iteración.</li>

<li>Si se trata de la primera iteración, se colocan en esa
carpeta, las plantillas para todos los entregables.</li>

<li>El Responsable de la calidad es el encargado de personalizar y
asegurarse que estén correctos los productos.</li>

<li>El Responsable de la colaboración se encarga de llevar el
control de las versiones de los documentos y que estén
resguardados en el repositorio en la carpeta correspondiente.</li>

<li>El Responsable de la colaboración coloca la tarjeta de Crear
la carpeta de la iteración en el Tablero en la columna POr
hacer, moviendo esa tarjeta según avanza en la realización de
esa actividad.</li>

<li>El Responsable de la calidad coloca la tarjeta Inicializar los
documentos en la carpeta de la nueva iteración en la columna
Por hacer del Tablero, moviendo esa tarjeta según avanza en la
realización de esa actividad.</li>
</ul>
</div>
</li>

<li><a id="org5a8801b"></a>Ejecutar el Plan del proyecto<br />
<div class="outline-text-6" id="text-org5a8801b">
<ul class="org-ul">
<li>Dentro de la Administración de proyectos, la actividad de
Ejecutar el proyecto tiene como objetivo asegurarse que se
lleve a cabo el plan en tiempo y forma.</li>

<li>Hay que darle seguimiento a las actividades que están
realizando los miembros del equipo.</li>

<li>Para saber si el plan se cumple, hay que dar el seguimiento a
su ejecución:

<ul class="org-ul">
<li>Evidencia de las reuniones del equipo de trabajo</li>

<li>Registro del estado del progreso actualizado</li>

<li>Repositorio del proyecto actualizado y respaldado</li>

<li>Solicitudes de cambios que se analizan y evalúan revisando
los impactos a los costos, calendario y requerimientos
técnicos que se necesitan. Si se aprueban, se documentan.</li>

<li>Cuando se está trabajando de forma iterativa, en la
ejecución se tiene el subconjunto de las actividades a
realizar en el proyecto, restringido al alcance de la
iteración.</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgcfc8328" class="outline-4">
<h4 id="orgcfc8328">Práctica Administrativa 3. Ejecutar el plan de la iteración</h4>
<div class="outline-text-4" id="text-orgcfc8328">
</div>
<ul class="org-ul">
<li><a id="org218afd3"></a>Objetivos<br />
<div class="outline-text-5" id="text-org218afd3">
<p>
Asegurarse que el <i>Plan del proyecto</i> se lleve a cabo en tiempo y
forma según lo planeado para la iteración.
</p>
</div>
</li>

<li><a id="org1bf0790"></a>Entrada<br />
<div class="outline-text-5" id="text-org1bf0790">
<p>
Condiciones: Iteración en ejecución
</p>

<p>
Productos de trabajo: <i>Tablero</i> de la iteración.
</p>
</div>
</li>

<li><a id="org12c69e8"></a>Resultado<br />
<div class="outline-text-5" id="text-org12c69e8">
<p>
Condiciones: Iteración en ejecución.
</p>

<p>
Productos de trabajo: <i>Tablero</i> actualizado.
</p>
</div>
</li>

<li><a id="org00847f1"></a>Actividades<br />
<div class="outline-text-5" id="text-org00847f1">
<p>
Ejecutar lo planeado para la iteración revisando y actualizando el <i>Tablero</i> (TA6)
</p>
</div>
</li>

<li><a id="org1a3817e"></a>Herramientas<br />
<div class="outline-text-5" id="text-org1a3817e">
<p>
Herramienta para el Tablero
</p>
</div>

<ul class="org-ul">
<li><a id="orgc368969"></a>Plan de iteración<br />
<div class="outline-text-6" id="text-orgc368969">
<p>
En la reunión diaria del equipo, en 15 minutos, todos contestan
3 preguntas y actualizan el estado del tablero de seguimiento
según sus avences.
</p>

<p>
Las preguntas son:
</p>

<ul class="org-ul">
<li>¿Qué hice desde la última reunión?</li>
<li>¿Qué haré?</li>
<li>¿Qué dificultades encontré?</li>
</ul>


<p>
Con base a las respuestas, el responsable de la colaboración actualiza el tablero moviendo las tarjetas a <i>Hecho</i> o generando nuevas.
</p>
</div>
</li>

<li><a id="orgccf51ed"></a>Técnica para ejecutar lo planeado para la iteración revisando y actualizando el <i>Tablero</i><br />
<div class="outline-text-6" id="text-orgccf51ed">
<p>
En las reuniones diarias del equipo, cada miembro muestra su
avance reflejado en el estado de sus tarjetas en las columnas
del <i>Tablero</i>.
</p>

<p>
Según su rol, de agregan nuevas tarjetas al <i>Tablero</i> de acuerdo
con sus responsabilidades.
</p>

<p>
El Responsable de la colaboración se asegura que todos
actualicen el <i>Tablero</i> moviendo sus tarjetas según el estado del
trabajo de cada día.
</p>

<p>
De esta manera todos sabrán en qué están trabajando los demás,
podrán establecer comunicación con quién tenga trabajo
relacionado, o del que dependa su actividad.
</p>

<p>
Todos pueden ver el avance de sus compañeros, notar si hay
retrasos y tratar de resolverlos.
</p>
</div>
</li>
