content/notas/IS/Notas.org
***** Evaluar y controlar el proyecto

      El objetivo de la actividad de Administración de proyectos
      llamada Evaluar y controlar el proyecto, es asegurarse que las
      actividades que se propusieron en el plan se lleven a cabo, que
      se cumplan con los compromisos establecidos y se tomen las
      acciones pertinentes ante situaciones especiales

*** Práctica Administratica 4. Evaluar y controlar la iteración

**** Objetivos

     Evaluar el avance de la iteración en el Tablero y controlar las
     dificultades encontradas.

**** Entrada

     Condiciones: Iteración en ejecución

     Productos de trabajo: Tablero de la iteración

**** Resultado

     Condiciones: Iteración en ejecución.

     Productos de trabajo: /Tablero/ de la iteración actualizado.

**** Actividades

     Evaluar el estado del progreso de la iteración a través del
     /Tablero/, identificando difucyltades y retrasos. Proponer
     soluciones para controlarlas y actualizar el /Tablero/ con las
     actividades necesarias.

***** Técnica para evaluar y controlar el estado del progreso de la iteración a través del /Tablero/

      Si al revisar el progreso de la iteración en el /Tablero/ se
      detectan retrasos o dificultades, entre todos los miembros del
      equipo se analizan las razones y, de común acuerdo, se proponen
      actividades correctivas para remediarlas.

      Los retrasos y dificultades encontradas pueden ocasionar la
      creación de nuevas tarjetas con actividades para rectificarlos.

      Si las dificultades son de origen técnico, el responsable
      técnico busca la manera para apoyar a los que están atrasados,
      incorporando nuevas tarjetas en el /Tablero/ con las actividades
      necesarias.

      Si el Responsable de la calidad revisando los productos
      generados por el equipo detecta defectos, crea una tarjeta de
      correción en el /Tablero/ y la asigna al responsable del defecto.

** Unidad 5. Requerimientos de software
*** ¿Qué es un requerimiento?

    "Los requerimientos de software expresan las necesidades y
    restricciones que debe tener un producto de software para que
    contribuya a la solución de un problema en el mundo real"
    (SWEBOK, 2014)

    "Los requerimientos de un producto de software son las
    descripciones de lo que hará, los servicios que proporcionará y
    las restricciones de su operación" (Sommerville I., 2011).

    Un requerimiento o necesidad es lo que el cliente o un usuario
    desean que haga el software para resolver un problema.
    
*** ¿Cómo se expresan los requerimientos?

    - Lenguaje natural

    - Forma gráfica

    - Prototipo de interfaz de usuario

*** Objetivos de la especificación de requerimientos

    - Entender le problema a resolver.

    - Construir un modelos de los requerimientos

    - Obtener criterios para varificar y validar el producto de
      software terminado.

*** Calidad de un producto de software
    
    La calidad de un producto de software se define como "capacidad de
    un producto de software de satisfacer las neceisdades expresas e
    implícitas en condiciones específicas".

    Al definir los requerimientos se busca claridad, precisión y no
    ambigüedad tanto para el desarrollador y para el cliente.

*** ¿Cómo asegurar la calidad de la especificación de los requerimientos?
    
    Que el cliente pueda evaluar la calidad de software, es revisando
    y avalando la especificación de los requerimientos.

    La validación final, de que el software cumple con los
    requerimientos especificados, se hace hasta que el software esté
    construido.

    Los requerimientos cambian constantemente.

*** Tipos de requerimientos

**** Funcionales

     Son los servicios, la forma en que el software debe reaccionar a
     entradas particulares y cómo debe comportarse en situaciones
     particulares.

**** No Funcionales

     Son restricciones que los servicios y y finciones de software
     deben cumplir.

     - Necesidades de la interfaz externa.
     - Cualidades del software.
     - Restricciones del diseño.
     - Otros.

*** Actividades para definir los requerimientos

    - Obtener: Entender (desarrollador / cliente)

    - Analizar: (desarrollador)

    - Especificar: Documentar texto, diagramas, prototipos (desarrollador)

    - Validar: (por el cliente)

    - Administrar: Cambios a requerimientos (desarrollador)

*** Caso de prueba

    Para todos los casos de uso se definen casos de prueba.

    Los casos de prueba se aplicarán cuando el caso de uso ya esté
    implementado para asegurar el cumplimiento de los requerimientos
    especificados.

    Los casos de prueba confirman la verificabilidad de los
    requerimientos.

*** Práctica de desarrollo de software

**** Requerimientos de software

***** Objetivos

      Comprender y especificar los requerimientos del sistema de
      software, basándose en el /Planteamineto de necesidades/.

***** Entrada

      *Condiciones*: Proyecto planificado.

      *Productos de trabajo*:

      - Plan del proyecto
      - Planteamiento de necesidades
      - Plantilla Especificación de Requerimientos de Software.
      - Repositorio compartido con la carpeta para la iteración.
      - Tablero de la iteración.

***** Resultado

      *Condiciones*: Requerimientos entendidos

      *Productos de trabajo*: Especificación de Requerimientos de
       Software.

***** Actividades

      1. Entender el /Planteamiento de necesidades/ para la iteración
      2. Analizar y especificar los requerimientos (TR2,TR3,TR4,TR5)
      3. Especificar los requerimientos no funcionales (TR6)
      4. Documentar la /Especificación de Requerimientos de Software/

***** Herramientas

      - Herramienta para hacer diagramas de UML.
      - Herramienta para diseñar el prototipo de interfaz de usuario.

