notas/IS/Notas.html

<li><a id="org92591cb"></a>Evaluar y controlar el proyecto<br />
<div class="outline-text-6" id="text-org92591cb">
<p>
El objetivo de la actividad de Administración de proyectos
llamada Evaluar y controlar el proyecto, es asegurarse que las
actividades que se propusieron en el plan se lleven a cabo, que
se cumplan con los compromisos establecidos y se tomen las
acciones pertinentes ante situaciones especiales
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org5c30075" class="outline-4">
<h4 id="org5c30075">Práctica Administratica 4. Evaluar y controlar la iteración</h4>
<div class="outline-text-4" id="text-org5c30075">
</div>
<ul class="org-ul">
<li><a id="orgacb2897"></a>Objetivos<br />
<div class="outline-text-5" id="text-orgacb2897">
<p>
Evaluar el avance de la iteración en el Tablero y controlar las
dificultades encontradas.
</p>
</div>
</li>

<li><a id="orgb779675"></a>Entrada<br />
<div class="outline-text-5" id="text-orgb779675">
<p>
Condiciones: Iteración en ejecución
</p>

<p>
Productos de trabajo: Tablero de la iteración
</p>
</div>
</li>

<li><a id="orgb8cb955"></a>Resultado<br />
<div class="outline-text-5" id="text-orgb8cb955">
<p>
Condiciones: Iteración en ejecución.
</p>

<p>
Productos de trabajo: <i>Tablero</i> de la iteración actualizado.
</p>
</div>
</li>

<li><a id="org876beb0"></a>Actividades<br />
<div class="outline-text-5" id="text-org876beb0">
<p>
Evaluar el estado del progreso de la iteración a través del
<i>Tablero</i>, identificando difucyltades y retrasos. Proponer
soluciones para controlarlas y actualizar el <i>Tablero</i> con las
actividades necesarias.
</p>
</div>

<ul class="org-ul">
<li><a id="org4d7682e"></a>Técnica para evaluar y controlar el estado del progreso de la iteración a través del <i>Tablero</i><br />
<div class="outline-text-6" id="text-org4d7682e">
<p>
Si al revisar el progreso de la iteración en el <i>Tablero</i> se
detectan retrasos o dificultades, entre todos los miembros del
equipo se analizan las razones y, de común acuerdo, se proponen
actividades correctivas para remediarlas.
</p>

<p>
Los retrasos y dificultades encontradas pueden ocasionar la
creación de nuevas tarjetas con actividades para rectificarlos.
</p>

<p>
Si las dificultades son de origen técnico, el responsable
técnico busca la manera para apoyar a los que están atrasados,
incorporando nuevas tarjetas en el <i>Tablero</i> con las actividades
necesarias.
</p>

<p>
Si el Responsable de la calidad revisando los productos
generados por el equipo detecta defectos, crea una tarjeta de
correción en el <i>Tablero</i> y la asigna al responsable del defecto.
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org947fd19" class="outline-3">
<h3 id="org947fd19">Unidad 5. Requerimientos de software</h3>
<div class="outline-text-3" id="text-org947fd19">
</div>
<div id="outline-container-org4b9f23f" class="outline-4">
<h4 id="org4b9f23f">¿Qué es un requerimiento?</h4>
<div class="outline-text-4" id="text-org4b9f23f">
<p>
"Los requerimientos de software expresan las necesidades y
restricciones que debe tener un producto de software para que
contribuya a la solución de un problema en el mundo real"
(SWEBOK, 2014)
</p>

<p>
"Los requerimientos de un producto de software son las
descripciones de lo que hará, los servicios que proporcionará y
las restricciones de su operación" (Sommerville I., 2011).
</p>

<p>
Un requerimiento o necesidad es lo que el cliente o un usuario
desean que haga el software para resolver un problema.
</p>
</div>
</div>

<div id="outline-container-orgedfbd2c" class="outline-4">
<h4 id="orgedfbd2c">¿Cómo se expresan los requerimientos?</h4>
<div class="outline-text-4" id="text-orgedfbd2c">
<ul class="org-ul">
<li>Lenguaje natural</li>

<li>Forma gráfica</li>

<li>Prototipo de interfaz de usuario</li>
</ul>
</div>
</div>

<div id="outline-container-org530e90d" class="outline-4">
<h4 id="org530e90d">Objetivos de la especificación de requerimientos</h4>
<div class="outline-text-4" id="text-org530e90d">
<ul class="org-ul">
<li>Entender le problema a resolver.</li>

<li>Construir un modelos de los requerimientos</li>

<li>Obtener criterios para varificar y validar el producto de
software terminado.</li>
</ul>
</div>
</div>

<div id="outline-container-org078b960" class="outline-4">
<h4 id="org078b960">Calidad de un producto de software</h4>
<div class="outline-text-4" id="text-org078b960">
<p>
La calidad de un producto de software se define como "capacidad de
un producto de software de satisfacer las neceisdades expresas e
implícitas en condiciones específicas".
</p>

<p>
Al definir los requerimientos se busca claridad, precisión y no
ambigüedad tanto para el desarrollador y para el cliente.
</p>
</div>
</div>

<div id="outline-container-orgfc486ed" class="outline-4">
<h4 id="orgfc486ed">¿Cómo asegurar la calidad de la especificación de los requerimientos?</h4>
<div class="outline-text-4" id="text-orgfc486ed">
<p>
Que el cliente pueda evaluar la calidad de software, es revisando
y avalando la especificación de los requerimientos.
</p>

<p>
La validación final, de que el software cumple con los
requerimientos especificados, se hace hasta que el software esté
construido.
</p>

<p>
Los requerimientos cambian constantemente.
</p>
</div>
</div>

<div id="outline-container-org7a2d9fc" class="outline-4">
<h4 id="org7a2d9fc">Tipos de requerimientos</h4>
<div class="outline-text-4" id="text-org7a2d9fc">
</div>
<ul class="org-ul">
<li><a id="orgddeb176"></a>Funcionales<br />
<div class="outline-text-5" id="text-orgddeb176">
<p>
Son los servicios, la forma en que el software debe reaccionar a
entradas particulares y cómo debe comportarse en situaciones
particulares.
</p>
</div>
</li>

<li><a id="org9d145a4"></a>No Funcionales<br />
<div class="outline-text-5" id="text-org9d145a4">
<p>
Son restricciones que los servicios y y finciones de software
deben cumplir.
</p>

<ul class="org-ul">
<li>Necesidades de la interfaz externa.</li>
<li>Cualidades del software.</li>
<li>Restricciones del diseño.</li>
<li>Otros.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org18f58de" class="outline-4">
<h4 id="org18f58de">Actividades para definir los requerimientos</h4>
<div class="outline-text-4" id="text-org18f58de">
<ul class="org-ul">
<li>Obtener: Entender (desarrollador / cliente)</li>

<li>Analizar: (desarrollador)</li>

<li>Especificar: Documentar texto, diagramas, prototipos (desarrollador)</li>

<li>Validar: (por el cliente)</li>

<li>Administrar: Cambios a requerimientos (desarrollador)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd71aa4" class="outline-4">
<h4 id="orgbd71aa4">Caso de prueba</h4>
<div class="outline-text-4" id="text-orgbd71aa4">
<p>
Para todos los casos de uso se definen casos de prueba.
</p>

<p>
Los casos de prueba se aplicarán cuando el caso de uso ya esté
implementado para asegurar el cumplimiento de los requerimientos
especificados.
</p>

<p>
Los casos de prueba confirman la verificabilidad de los
requerimientos.
</p>
</div>
</div>

<div id="outline-container-orgc65fa5b" class="outline-4">
<h4 id="orgc65fa5b">Práctica de desarrollo de software</h4>
<div class="outline-text-4" id="text-orgc65fa5b">
</div>
<ul class="org-ul">
<li><a id="org8416008"></a>Requerimientos de software<br />
<ul class="org-ul">
<li><a id="org000b3bb"></a>Objetivos<br />
<div class="outline-text-6" id="text-org000b3bb">
<p>
Comprender y especificar los requerimientos del sistema de
software, basándose en el <i>Planteamineto de necesidades</i>.
</p>
</div>
</li>

<li><a id="org510fc3d"></a>Entrada<br />
<div class="outline-text-6" id="text-org510fc3d">
<p>
<b>Condiciones</b>: Proyecto planificado.
</p>

<p>
<b>Productos de trabajo</b>:
</p>

<ul class="org-ul">
<li>Plan del proyecto</li>
<li>Planteamiento de necesidades</li>
<li>Plantilla Especificación de Requerimientos de Software.</li>
<li>Repositorio compartido con la carpeta para la iteración.</li>
<li>Tablero de la iteración.</li>
</ul>
</div>
</li>

<li><a id="org55a3130"></a>Resultado<br />
<div class="outline-text-6" id="text-org55a3130">
<p>
<b>Condiciones</b>: Requerimientos entendidos
</p>

<p>
<b>Productos de trabajo</b>: Especificación de Requerimientos de
 Software.
</p>
</div>
</li>

<li><a id="orgeb6ee9e"></a>Actividades<br />
<div class="outline-text-6" id="text-orgeb6ee9e">
<ol class="org-ol">
<li>Entender el <i>Planteamiento de necesidades</i> para la iteración</li>
<li>Analizar y especificar los requerimientos (TR2,TR3,TR4,TR5)</li>
<li>Especificar los requerimientos no funcionales (TR6)</li>
<li>Documentar la <i>Especificación de Requerimientos de Software</i></li>
</ol>
</div>
</li>

<li><a id="orgcbd51ce"></a>Herramientas<br />
<div class="outline-text-6" id="text-orgcbd51ce">
<ul class="org-ul">
<li>Herramienta para hacer diagramas de UML.</li>
<li>Herramienta para diseñar el prototipo de interfaz de usuario.</li>
</ul>
</div>

<ul class="org-ul">
