content/notas/IS/Notas.org
****** Entender el /Planteamiento de necesidades/ para la iteración
       A fin de entender el problema para poder especificar los
       requerimientos se pueden llevar a cabo estas actividades:

       - Hacer entrevistas con posibles usuarios.
       - Aplicar cuestionarios a los usuarios.
       - Observar a los futuros usuarios al realizar las tareas que
         apoyará el software
       - Revisar documentos o sistemas ya existentes que se pretenden
         mejorar.
       - Hacer un glosario de términos.


       *Glosario de términos*:

       Para que todos los involucrados puedan comunicarse más
       fácilmente, se recomienda construir un Glosario de términos
       para establecer un vocabulario común.

       El glosario de términos es un pequeño diccionario, donde se
       registran los término importantes para entender el proble y su
       significado.

       EL glosario se puede ir actualizando a lo largo del proyecto.

       - El Responsable de la colaboración, pone una tarjeta en el
         /Tablero/ en la columna de por hacer, con la actividad de Hacer
         el /Glosario de términos/ y lo asigna al Responsable técnico.

       - El responsable técnico mueve la tarjeta a la columna de
         /Haciendo/ y dirige la discusión para hacer el /Glosario de
         términos/. Al terminar el glosario, mueve la tarjeta a la
         columna /Hecho/.

       - El Responsable de calidad se asegura que se ponga el glosario
         en la plantilla personalizada de /Especificación de
         Requerimientos de Software/.
       
****** Analizar y especificar los requerimientos funcionales
       Los casos de uso permiten de manera simple definir como los
       usuarios utilizarán el software.

       Servirán de hilo conductor para todo el proceso de desarrollo
       en el /Método Incial de Desarrollo de Software/.

******* Hacer el diagrama de Casos de Uso para la Iteración

	Para iniciar una iteración los desarrolladores deben de
	revisar el Plan de Proyecto, que contienen el Diagrama General
	de Casos de Uso de todo el sistema.

	Todos participan en la selección de los casos de uso para la
	iteración y hacen un diagrama general con el subconjunto de
	casos de uso que se desarrollarán en esa iteración.

	Se asigna al menos un caso de uso a cada desarrollador.

	- El Responsable de la colaboración, pone una tarjeta en el
          Tablero en la columna de /Por Hacer/, con la actividad de
          Hacer el diagrama de casos de uso de la iteración y lo
          asigna al Responsable técnico.

	- El Responsable técnico mueve la tarjeta a la columna de
          /Haciendo/, revisa con todo el equipo el /Diagrama General de
          Casos de Uso de todo el sistema/ para identificar los casos
          de uso seleccionados para la iteración y dibujan el diagrama
          general de casos de uso de la iteración.

	- Al terminar el diagrama, Responsable técnico mueve la
          tarjeta a la columna /Hecho/.

	- El Responsable de calidad asegura que se integre en la
          plantilla personalizada de Especificación de Requerimientos
          de Software.
	  
******* Detallar los casos de uso

	*Caso de uso*: El nombre deberá ser un verbo en infinitivo
	representativo de la funcionalidad del caso de uso (el mismo
	que en el diagrama general).

	*Diagrama del caso de uso*: dibujo del o los actores y el caso
	de uso en cuestión.

	*Descripción*: Texto breve describiendo la función que
	representa el caso de uso.

	*Precondiciones*: El estado en el que se encuentra el sistema
	para que el actor (o los actores) pueda iniciar el caso de
	uso.

	*Flujo normal de eventos*: Tabla que describe el flujo de
	interacciones esperadas (/el camino feliz/) entre el actor y el
	sistema durante el caso de uso.

	*Flujo excepcional de eventos*: Tabla con las acciones que
	ocurren en situaciones anormales o excepcionales.

	*Poscondiciones*: Define el estado en el que se encuentra el
	sistema después de la terminación exitosa del caso de uso.

	- Cada miembro del equipo escoge al menos un caso de uso,
          dentro del alcance de la iteración representado en el
          /Diagrama de Casos de Uso/ para la iteración, para detallarlo.

	- El responsable de la colaboración, pone una tarjeta en el
          Tablero en la columna de /Por Hacer/, con la actividad de
          /Detallar el caso de uso/ para cada caso de uso de la
          iteración y se lo asigna al miembro del equipo que lo
          detallará.

	- Cada miembro del equipo al iniciar el detalle de su caso de
          uso, mueve su tarjeta del tablero a la columna /Haciendo/ y
          usa el formato propuesto para detallar el caso de uso del
          que es responsable. Al terminar de llenar todos los campos,
          mueve su tarjeta a la columna de /Hecho/.

	- El Responsable de calidad asegura que se pongan los detalles
          de todos los casos de uso en la plantilla personalizada de
          /Especificación de Requerimientos de Software/.
	
******* Definición del prototipo de interfaz de usuario

	- Un prototipo de interfaz de usuario es una representación
          inicial de las pantallas que el software mostrará al
          usuario.

	- Estas pantallas muestran la distribución de diferentes
          elementos que permitirań al usuario interactuar con el
          sistema pero que no ofrecen ninguna funcionalidad
          implementada.


	El Responsable de la colaboración, pone una tarjeta en el
	/Tablero/ en la columna de /Por Hacer/, con la actividad de
	/Definir el prototipo/ para cada caso de uso de la iteración y
	se lo asigna al miembro del equipo que definirá la interfaz.

	Todo el equipo se pone de acuerdo en lineamientos para el
	diseño de la interfaz de usuario y escoge la manera para
	realizarlo.

	Cada miembro del equipo define el prototipo de interfaz que
	corresponde al detalle de su caso de uso para los flujos
	normal, alternativos y excepcionales.

	Cada miembro del equipo al iniciar la actividad, mueve su
	tarjeta del tablero a la columna /Haciendo/ y usa el formato
	propuesto para definir el prototipo para el caso de uso del
	que es responsable. Al terminar la actividad, mueve su tarjeta
	a la columna de /Hecho/.

	El responsable de calidad se asegura que los prototipos se
	integren en la plantilla personalizada de /Especificación de
	Requerimientos de software/.

******* Casos de prueba para los requerimientos funcionales

	- Los casos de prueba para cada caso de uso se documentan en
          una tabla.

	- Un caso de prueba identifica las entradas al caso de uso y
          los resultados esperados.

	- Se consideran entradas para flujos normales, alternativos y
          excepcionales.


	El Responsable de la colaboración, pone una tarjeta en el
	Tablero en la columna de /Por Hacer/, con la actividad de
	Definir los casos de prueba para cada caso de uso de la
	iteración y se lo asigna al miembro del equipo que definirá
	sus casos de prueba.

	Cada miembro del equipo define los casos de prueba que
	corresponden al detalle de su caso de uso en los flujos
	normales, alternativos y excepcionales.

	Cada miembro del equipo al iniciar la actividad, mueve su
	tarjeta del tablero a la columna /Haciendo/ y usa el formato
	propuesto para definir los casos de prueba para el caso de uso
	de los que es responsable. Al terminar la actividad, mueve su
	tarjeta a la columna de /Hecho/.

	El Responsable de calidad se asegura que se integren los casos
	de prueba en la plantilla personalizada de /Especificación de
	Requerimientos de software/.
	
