notas/IS/Notas.html
<li><a id="org495ea84"></a>Entender el <i>Planteamiento de necesidades</i> para la iteración<br />
<div class="outline-text-7" id="text-org495ea84">
<p>
A fin de entender el problema para poder especificar los
requerimientos se pueden llevar a cabo estas actividades:
</p>

<ul class="org-ul">
<li>Hacer entrevistas con posibles usuarios.</li>
<li>Aplicar cuestionarios a los usuarios.</li>
<li>Observar a los futuros usuarios al realizar las tareas que
apoyará el software</li>
<li>Revisar documentos o sistemas ya existentes que se pretenden
mejorar.</li>
<li>Hacer un glosario de términos.</li>
</ul>


<p>
<b>Glosario de términos</b>:
</p>

<p>
Para que todos los involucrados puedan comunicarse más
fácilmente, se recomienda construir un Glosario de términos
para establecer un vocabulario común.
</p>

<p>
El glosario de términos es un pequeño diccionario, donde se
registran los término importantes para entender el proble y su
significado.
</p>

<p>
EL glosario se puede ir actualizando a lo largo del proyecto.
</p>

<ul class="org-ul">
<li>El Responsable de la colaboración, pone una tarjeta en el
<i>Tablero</i> en la columna de por hacer, con la actividad de Hacer
el <i>Glosario de términos</i> y lo asigna al Responsable técnico.</li>

<li>El responsable técnico mueve la tarjeta a la columna de
<i>Haciendo</i> y dirige la discusión para hacer el <i>Glosario de
términos</i>. Al terminar el glosario, mueve la tarjeta a la
columna <i>Hecho</i>.</li>

<li>El Responsable de calidad se asegura que se ponga el glosario
en la plantilla personalizada de <i>Especificación de
Requerimientos de Software</i>.</li>
</ul>
</div>
</li>

<li><a id="org3684c79"></a>Analizar y especificar los requerimientos funcionales<br />
<div class="outline-text-7" id="text-org3684c79">
<p>
Los casos de uso permiten de manera simple definir como los
usuarios utilizarán el software.
</p>

<p>
Servirán de hilo conductor para todo el proceso de desarrollo
en el <i>Método Incial de Desarrollo de Software</i>.
</p>
</div>

<ul class="org-ul">
<li><a id="orge5f3f91"></a>Hacer el diagrama de Casos de Uso para la Iteración<br />
<div class="outline-text-8" id="text-orge5f3f91">
<p>
Para iniciar una iteración los desarrolladores deben de
revisar el Plan de Proyecto, que contienen el Diagrama General
de Casos de Uso de todo el sistema.
</p>

<p>
Todos participan en la selección de los casos de uso para la
iteración y hacen un diagrama general con el subconjunto de
casos de uso que se desarrollarán en esa iteración.
</p>

<p>
Se asigna al menos un caso de uso a cada desarrollador.
</p>

<ul class="org-ul">
<li>El Responsable de la colaboración, pone una tarjeta en el
Tablero en la columna de <i>Por Hacer</i>, con la actividad de
Hacer el diagrama de casos de uso de la iteración y lo
asigna al Responsable técnico.</li>

<li>El Responsable técnico mueve la tarjeta a la columna de
<i>Haciendo</i>, revisa con todo el equipo el <i>Diagrama General de
Casos de Uso de todo el sistema</i> para identificar los casos
de uso seleccionados para la iteración y dibujan el diagrama
general de casos de uso de la iteración.</li>

<li>Al terminar el diagrama, Responsable técnico mueve la
tarjeta a la columna <i>Hecho</i>.</li>

<li>El Responsable de calidad asegura que se integre en la
plantilla personalizada de Especificación de Requerimientos
de Software.</li>
</ul>
</div>
</li>

<li><a id="org7134c93"></a>Detallar los casos de uso<br />
<div class="outline-text-8" id="text-org7134c93">
<p>
<b>Caso de uso</b>: El nombre deberá ser un verbo en infinitivo
representativo de la funcionalidad del caso de uso (el mismo
que en el diagrama general).
</p>

<p>
<b>Diagrama del caso de uso</b>: dibujo del o los actores y el caso
de uso en cuestión.
</p>

<p>
<b>Descripción</b>: Texto breve describiendo la función que
representa el caso de uso.
</p>

<p>
<b>Precondiciones</b>: El estado en el que se encuentra el sistema
para que el actor (o los actores) pueda iniciar el caso de
uso.
</p>

<p>
<b>Flujo normal de eventos</b>: Tabla que describe el flujo de
interacciones esperadas (<i>el camino feliz</i>) entre el actor y el
sistema durante el caso de uso.
</p>

<p>
<b>Flujo excepcional de eventos</b>: Tabla con las acciones que
ocurren en situaciones anormales o excepcionales.
</p>

<p>
<b>Poscondiciones</b>: Define el estado en el que se encuentra el
sistema después de la terminación exitosa del caso de uso.
</p>

<ul class="org-ul">
<li>Cada miembro del equipo escoge al menos un caso de uso,
dentro del alcance de la iteración representado en el
<i>Diagrama de Casos de Uso</i> para la iteración, para detallarlo.</li>

<li>El responsable de la colaboración, pone una tarjeta en el
Tablero en la columna de <i>Por Hacer</i>, con la actividad de
<i>Detallar el caso de uso</i> para cada caso de uso de la
iteración y se lo asigna al miembro del equipo que lo
detallará.</li>

<li>Cada miembro del equipo al iniciar el detalle de su caso de
uso, mueve su tarjeta del tablero a la columna <i>Haciendo</i> y
usa el formato propuesto para detallar el caso de uso del
que es responsable. Al terminar de llenar todos los campos,
mueve su tarjeta a la columna de <i>Hecho</i>.</li>

<li>El Responsable de calidad asegura que se pongan los detalles
de todos los casos de uso en la plantilla personalizada de
<i>Especificación de Requerimientos de Software</i>.</li>
</ul>
</div>
</li>

<li><a id="org43abb44"></a>Definición del prototipo de interfaz de usuario<br />
<div class="outline-text-8" id="text-org43abb44">
<ul class="org-ul">
<li>Un prototipo de interfaz de usuario es una representación
inicial de las pantallas que el software mostrará al
usuario.</li>

<li>Estas pantallas muestran la distribución de diferentes
elementos que permitirań al usuario interactuar con el
sistema pero que no ofrecen ninguna funcionalidad
implementada.</li>
</ul>


<p>
El Responsable de la colaboración, pone una tarjeta en el
<i>Tablero</i> en la columna de <i>Por Hacer</i>, con la actividad de
<i>Definir el prototipo</i> para cada caso de uso de la iteración y
se lo asigna al miembro del equipo que definirá la interfaz.
</p>

<p>
Todo el equipo se pone de acuerdo en lineamientos para el
diseño de la interfaz de usuario y escoge la manera para
realizarlo.
</p>

<p>
Cada miembro del equipo define el prototipo de interfaz que
corresponde al detalle de su caso de uso para los flujos
normal, alternativos y excepcionales.
</p>

<p>
Cada miembro del equipo al iniciar la actividad, mueve su
tarjeta del tablero a la columna <i>Haciendo</i> y usa el formato
propuesto para definir el prototipo para el caso de uso del
que es responsable. Al terminar la actividad, mueve su tarjeta
a la columna de <i>Hecho</i>.
</p>

<p>
El responsable de calidad se asegura que los prototipos se
integren en la plantilla personalizada de <i>Especificación de
Requerimientos de software</i>.
</p>
</div>
</li>

<li><a id="orga1d336a"></a>Casos de prueba para los requerimientos funcionales<br />
<div class="outline-text-8" id="text-orga1d336a">
<ul class="org-ul">
<li>Los casos de prueba para cada caso de uso se documentan en
una tabla.</li>

<li>Un caso de prueba identifica las entradas al caso de uso y
los resultados esperados.</li>

<li>Se consideran entradas para flujos normales, alternativos y
excepcionales.</li>
</ul>


<p>
El Responsable de la colaboración, pone una tarjeta en el
Tablero en la columna de <i>Por Hacer</i>, con la actividad de
Definir los casos de prueba para cada caso de uso de la
iteración y se lo asigna al miembro del equipo que definirá
sus casos de prueba.
</p>

<p>
Cada miembro del equipo define los casos de prueba que
corresponden al detalle de su caso de uso en los flujos
normales, alternativos y excepcionales.
</p>

<p>
Cada miembro del equipo al iniciar la actividad, mueve su
tarjeta del tablero a la columna <i>Haciendo</i> y usa el formato
propuesto para definir los casos de prueba para el caso de uso
de los que es responsable. Al terminar la actividad, mueve su
tarjeta a la columna de <i>Hecho</i>.
</p>

<p>
El Responsable de calidad se asegura que se integren los casos
de prueba en la plantilla personalizada de <i>Especificación de
Requerimientos de software</i>.
</p>
</div>
</li>
</ul>
</li>
