content/notas/IS/Notas.org
****** Especificar los requerimientos no funcionales.

       Cuando ya se tienen entendidas las funcionalidades que deberá
       ofrecer el sistema de software, se especifican las
       características o requerimientos no funcionales que deberá
       cumplir.

       - El Responsable de la colaboración, pone una tarjeta en el
         Tablero en la columna de /Por Hacer/, con la actividad de
         Especificar los requerimientos no funcionales y la asigna al
         Responsable técnico.

       - Todos los miembros del equipo revisan el /Planteamiento de
         Necesidades/ para la iteración e identifican los
         requerimientos no funcionales en la sección de
         Resctricciones.

       - El Responsable Técnico redacta el texto con los
         requerimientos no funcionales.

       - El Responsable de calidad redacta el texto con los
         requerimientos no funcionales.

       - EL Responsable de calidad s easegura que se integren los
         requerimientos no funcionales en la plantilla personalizada
         de /Especificación de Requerimientos de Software/.

****** Documentar la Especificación de Requerimientos de Software
       Una vez aplicadas todas las técnicas anteriores, se han
       generado una serie de resultados que al juntarlos conforman la
       /Especificación de Requerimientos de Software/.

******* Documentar la Especificación de Requerimientos de Software

	La labor del Responsable de calidad es asegurar que fueron
	integrados todos los elementos generados en esta práctica en
	la plantilla personalizada del documento.

	El Responsable de Calidad asegura la integración de todos los
	elementos en el documento de Especificación de Requerimientos
	de Software siguiendo la plantilla.

** Unidad 6. Diseño de Software

*** Diseño de Software

    Diseño de cualquier producto consiste en crear un modelo o
    representación delo que se construirá más adelante.

    Diseño de software es el conjunto de actividades creativas
    mediante las cuales los requerimientos se traducen en una
    representación del software.

*** Objetivos del diseño

    Identificar y caracterizar las partes o componentes principales
    sel software.

    Definir su interacción e integración en el producto, para llegar
    al nivel de detalle que permita su mapeo al código en algún
    lenguaje de programación.

*** Niveles de abstracción.

    *Diseño arquitectónico*: Describe cómo se descompone y organiza el
    software en componentes abstractos partiendo de la especificación
    de requerimientos.

    *Diseño detallado*: Describe el comportamiento específico de esos
    componentes tomando en cuenta el ambiente en el cual se
    codificará.
 
*** Principios para el Diseño

    *Abstracción*: Es una vista de un objeto qu se centra en la
    información relevante para un propósito particular e ignora el
    resto de la información. Para el diseño de software inicialmente
    se abstraen las propiedades más generales que deberán tener los
    componentes del software a construir.

    La sbtracción se refiere a identificar y modelar de forma
    estructurada propiedades esenciales de un conjunto de objetos
    omieitndo detalles no esenciales, según sea el caso.

    La abtracción segmentada se puede referir a dividir en múltiples
    elementos que permitan manejar fácilmente un sistema en su
    conjunto.

    *Separación de conceptos*: Una preocupaciń de diseño es la
    separación de elementos relevantes para uno o más de sus
    involucrados. Cada vista de arquitectura refleja uno o más
    intereses. Separar los conceptos por vistas permite a los
    interesados centrarse en cosas a la vez y de esta manera manejar
    la complejidad.

    La abtracción modular se refiere a que cada elemento cumpla
    funcionalidades que lo hagan un componente individual.

    *Descomposición y modularización*: Descomponer y modularizar el
    software significa dividirlo en una serie de pequeños componentes,
    que tienen bien definidos interfaces y que describen las
    interacciones de los componentes. Por lo general, el objetivo es
    colocar diferentes funcionalidades y responsabilidades en
    diferentes componentes.

    *Acoplamiento y cohesión*: El acoplamiento está definido como "una
    medida de la interdependencia entre módulos en un programa de
    computadora", mientras que cohesión se define como "una medida de
    la fuerza de asociación de los elementos dentro de un módulo".

    Un buen diseño busca la cohesión de módulos alta y el acoplamiento
    débil.

    *Encapsulamiento y ocultamiento de la información*: Propone agrupar
    y empaquetar los detalles internos de una abstracción y hacer esos
    detalles inaccesibles a entidades externas.

    *Separación de la interfaz y la implementación*: Significa definir
    un componente especificando una interfaz pública la cual está
    separada de los detalles de cómo el componente se realiza.

    *Refinamiento sucesivo*: Es extender deductivamente el modelo
    conceptual de requerimientos en una serie de incrementos
    precisando cada vez especificacions que aumentan el nivel de
    detalle.

*** Otros principios

    *Diseñar para el cambio* significa que el diseño debe ser flexible
    para permitir cambios con relativa facilidad.

    *Diseñar para facilitar el uso del software* considera algunos
    escenarios del uso del software y su interfaz puede ayudar en el
    diseño de los componentes apropiados.

    *Diseñar para facilitar la prueba*. Los componente del sistema deben
    estar diseñados como unidades que se pueden probar sin depender de
    la implementación de otros componentes.

    *Diseñar para la reutilización*. Consiste en definir partes
    generićas que puedan volver a usarse. Para aplicar este principio
    se deben identificar los componente comunes que se podrán
    reutilizar. El reuso incluye no solo el niver del diseño, sino de
    código, casos de prueba, modelos o diagramas.

    El diseño es una actividad creativa por lo que no existe "el
    mejor"diseño.

*** Cualidades del software

    Al diseñar se deben considerar las cualidades que deberá tener,
    como:

    - La arquitectura: integridad, corrección, facilidad de
      construcción y completitud.

    - De uso: seguridad, eficiencia, funcionalidad y usabilidad.

    - De ejecución: facilidad de modificación, de prueba, reusabilidad
      y portabilidad.

**** Arquitectura de software

     Cualidades que debe tener la arquitectura:

     - Sencillez. Fácil de comprender y de implementar.

     - Extensión. La posibilidad de agregar nuevos componentes.

     - Cambio. Los cambios en los requerimientos no afecten mucho a la
       arquitectura.

***** Actividades para definir la arquitectura

      - Seleccionar el tipo de arquitectura del software según el tipo
	de la aplicaciónp a desarrollar.

      - Identificar los componentes que conformarán la arquitectura
        del software según el tipo de la aplicación a desarrollar.

