notas/IS/Notas.html

<li><a id="org3c708df"></a>Especificar los requerimientos no funcionales.<br />
<div class="outline-text-7" id="text-org3c708df">
<p>
Cuando ya se tienen entendidas las funcionalidades que deberá
ofrecer el sistema de software, se especifican las
características o requerimientos no funcionales que deberá
cumplir.
</p>

<ul class="org-ul">
<li>El Responsable de la colaboración, pone una tarjeta en el
Tablero en la columna de <i>Por Hacer</i>, con la actividad de
Especificar los requerimientos no funcionales y la asigna al
Responsable técnico.</li>

<li>Todos los miembros del equipo revisan el <i>Planteamiento de
Necesidades</i> para la iteración e identifican los
requerimientos no funcionales en la sección de
Resctricciones.</li>

<li>El Responsable Técnico redacta el texto con los
requerimientos no funcionales.</li>

<li>El Responsable de calidad redacta el texto con los
requerimientos no funcionales.</li>

<li>EL Responsable de calidad s easegura que se integren los
requerimientos no funcionales en la plantilla personalizada
de <i>Especificación de Requerimientos de Software</i>.</li>
</ul>
</div>
</li>

<li><a id="org052ea58"></a>Documentar la Especificación de Requerimientos de Software<br />
<div class="outline-text-7" id="text-org052ea58">
<p>
Una vez aplicadas todas las técnicas anteriores, se han
generado una serie de resultados que al juntarlos conforman la
<i>Especificación de Requerimientos de Software</i>.
</p>
</div>

<ul class="org-ul">
<li><a id="orga72ebed"></a>Documentar la Especificación de Requerimientos de Software<br />
<div class="outline-text-8" id="text-orga72ebed">
<p>
La labor del Responsable de calidad es asegurar que fueron
integrados todos los elementos generados en esta práctica en
la plantilla personalizada del documento.
</p>

<p>
El Responsable de Calidad asegura la integración de todos los
elementos en el documento de Especificación de Requerimientos
de Software siguiendo la plantilla.
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd343557" class="outline-3">
<h3 id="orgd343557">Unidad 6. Diseño de Software</h3>
<div class="outline-text-3" id="text-orgd343557">
</div>
<div id="outline-container-org0edd5c7" class="outline-4">
<h4 id="org0edd5c7">Diseño de Software</h4>
<div class="outline-text-4" id="text-org0edd5c7">
<p>
Diseño de cualquier producto consiste en crear un modelo o
representación delo que se construirá más adelante.
</p>

<p>
Diseño de software es el conjunto de actividades creativas
mediante las cuales los requerimientos se traducen en una
representación del software.
</p>
</div>
</div>

<div id="outline-container-orgebb6a0e" class="outline-4">
<h4 id="orgebb6a0e">Objetivos del diseño</h4>
<div class="outline-text-4" id="text-orgebb6a0e">
<p>
Identificar y caracterizar las partes o componentes principales
sel software.
</p>

<p>
Definir su interacción e integración en el producto, para llegar
al nivel de detalle que permita su mapeo al código en algún
lenguaje de programación.
</p>
</div>
</div>

<div id="outline-container-org3366e49" class="outline-4">
<h4 id="org3366e49">Niveles de abstracción.</h4>
<div class="outline-text-4" id="text-org3366e49">
<p>
<b>Diseño arquitectónico</b>: Describe cómo se descompone y organiza el
software en componentes abstractos partiendo de la especificación
de requerimientos.
</p>

<p>
<b>Diseño detallado</b>: Describe el comportamiento específico de esos
componentes tomando en cuenta el ambiente en el cual se
codificará.
</p>
</div>
</div>

<div id="outline-container-orgc1828ac" class="outline-4">
<h4 id="orgc1828ac">Principios para el Diseño</h4>
<div class="outline-text-4" id="text-orgc1828ac">
<p>
<b>Abstracción</b>: Es una vista de un objeto qu se centra en la
información relevante para un propósito particular e ignora el
resto de la información. Para el diseño de software inicialmente
se abstraen las propiedades más generales que deberán tener los
componentes del software a construir.
</p>

<p>
La sbtracción se refiere a identificar y modelar de forma
estructurada propiedades esenciales de un conjunto de objetos
omieitndo detalles no esenciales, según sea el caso.
</p>

<p>
La abtracción segmentada se puede referir a dividir en múltiples
elementos que permitan manejar fácilmente un sistema en su
conjunto.
</p>

<p>
<b>Separación de conceptos</b>: Una preocupaciń de diseño es la
separación de elementos relevantes para uno o más de sus
involucrados. Cada vista de arquitectura refleja uno o más
intereses. Separar los conceptos por vistas permite a los
interesados centrarse en cosas a la vez y de esta manera manejar
la complejidad.
</p>

<p>
La abtracción modular se refiere a que cada elemento cumpla
funcionalidades que lo hagan un componente individual.
</p>

<p>
<b>Descomposición y modularización</b>: Descomponer y modularizar el
software significa dividirlo en una serie de pequeños componentes,
que tienen bien definidos interfaces y que describen las
interacciones de los componentes. Por lo general, el objetivo es
colocar diferentes funcionalidades y responsabilidades en
diferentes componentes.
</p>

<p>
<b>Acoplamiento y cohesión</b>: El acoplamiento está definido como "una
medida de la interdependencia entre módulos en un programa de
computadora", mientras que cohesión se define como "una medida de
la fuerza de asociación de los elementos dentro de un módulo".
</p>

<p>
Un buen diseño busca la cohesión de módulos alta y el acoplamiento
débil.
</p>

<p>
<b>Encapsulamiento y ocultamiento de la información</b>: Propone agrupar
y empaquetar los detalles internos de una abstracción y hacer esos
detalles inaccesibles a entidades externas.
</p>

<p>
<b>Separación de la interfaz y la implementación</b>: Significa definir
un componente especificando una interfaz pública la cual está
separada de los detalles de cómo el componente se realiza.
</p>

<p>
<b>Refinamiento sucesivo</b>: Es extender deductivamente el modelo
conceptual de requerimientos en una serie de incrementos
precisando cada vez especificacions que aumentan el nivel de
detalle.
</p>
</div>
</div>

<div id="outline-container-org9ee9bd2" class="outline-4">
<h4 id="org9ee9bd2">Otros principios</h4>
<div class="outline-text-4" id="text-org9ee9bd2">
<p>
<b>Diseñar para el cambio</b> significa que el diseño debe ser flexible
para permitir cambios con relativa facilidad.
</p>

<p>
<b>Diseñar para facilitar el uso del software</b> considera algunos
escenarios del uso del software y su interfaz puede ayudar en el
diseño de los componentes apropiados.
</p>

<p>
<b>Diseñar para facilitar la prueba</b>. Los componente del sistema deben
estar diseñados como unidades que se pueden probar sin depender de
la implementación de otros componentes.
</p>

<p>
<b>Diseñar para la reutilización</b>. Consiste en definir partes
generićas que puedan volver a usarse. Para aplicar este principio
se deben identificar los componente comunes que se podrán
reutilizar. El reuso incluye no solo el niver del diseño, sino de
código, casos de prueba, modelos o diagramas.
</p>

<p>
El diseño es una actividad creativa por lo que no existe "el
mejor"diseño.
</p>
</div>
</div>

<div id="outline-container-orge4d7872" class="outline-4">
<h4 id="orge4d7872">Cualidades del software</h4>
<div class="outline-text-4" id="text-orge4d7872">
<p>
Al diseñar se deben considerar las cualidades que deberá tener,
como:
</p>

<ul class="org-ul">
<li>La arquitectura: integridad, corrección, facilidad de
construcción y completitud.</li>

<li>De uso: seguridad, eficiencia, funcionalidad y usabilidad.</li>

<li>De ejecución: facilidad de modificación, de prueba, reusabilidad
y portabilidad.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgfc80a62"></a>Arquitectura de software<br />
<div class="outline-text-5" id="text-orgfc80a62">
<p>
Cualidades que debe tener la arquitectura:
</p>

<ul class="org-ul">
<li>Sencillez. Fácil de comprender y de implementar.</li>

<li>Extensión. La posibilidad de agregar nuevos componentes.</li>

<li>Cambio. Los cambios en los requerimientos no afecten mucho a la
arquitectura.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org42d58fc"></a>Actividades para definir la arquitectura<br />
<div class="outline-text-6" id="text-org42d58fc">
<ul class="org-ul">
<li>Seleccionar el tipo de arquitectura del software según el tipo
de la aplicaciónp a desarrollar.</li>

<li>Identificar los componentes que conformarán la arquitectura
del software según el tipo de la aplicación a desarrollar.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org016a04c" class="outline-2">
<h2 id="org016a04c">Tareas</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2023-08-17 Thu 15:56</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>